"use client"

import { useState } from "react";
import { title } from "@/components/primitives";
import { Button, Card, CardBody, Checkbox } from "@heroui/react";
import { useRouter } from "next/navigation";

export default function PrivacyPage() {
  const [agree, setAgree] = useState(false);
  const router = useRouter();

  return (
    <div className="flex flex-col gap-5">
      <div className="flex flex-col">
        <h2 className={title({ size: "xs" })}>นโยบายส่วนตัว</h2>
        <h1 className={title({ size: "xs" })}>Privacy Policy</h1>
      </div>
      <Card className="h-96">
        <CardBody>
          <p>
            คำประกาศเกี่ยวกับความเป็นส่วนตัว (Privacy Notice) ของ
            ระบบเก็บข้อมูล โครงการตรวจสุขภาพล้านคนของ กรุงเทพมหานคร
            สุขภาพดีปี2 คำประกาศเกี่ยวกับความเป็นส่วนตัว (“ประกาศ”)
            นี้จัดทำขึ้นเพื่อให้ท่านซึ่งเป็นผู้ใช้งาน ระบบ เก็บช้อมูล
            โครงการตรวจสุขภาพล้านคนของ กรุงเทพมหานคร สุขภาพดีปี2
            (ซึ่งต่อไปในประกาศนี้ เรียกว่า “กิจกรรมการประมวลผล”)
            ได้ทราบและเข้าใจรูปแบบการเก็บรวบรวม ใช้และเปิดเผย (“ประมวลผล”)
            ข้อมูลส่วนบุคคลที่ กรุงเทพมหานคร
            โดยมอบหมายให้ทางโรงพยาบาลราชพิพัฒน์ ภายใต้ สำนักการแพทย์ดำเนินการ
            ในฐานะ ผู้ควบคุมข้อมูลส่วนบุคคล
            ในข้อมูลส่วนบุคคลที่เก็บรวบรวมจากท่าน
            เพื่อการดำเนินการภายใต้กิจกรรมการประมวลผลนี้
          </p>
          <p>
            ทางโรงพยาบาลราชพิพัฒน์ ภายใต้สังกัดสำนักการแพทย์กรุงเทพมหานคร
            ได้รับมอบหมายให้ พัฒนา
            ระบบการจัดเก็บข้อมูลการตรวจสุขภาพของคนในพื้นที่กรุงเทพมหานคร
            ตามโครงการตรวจสุขภาพ ล้านคน กรุงเทพมหานคร สุขภาพดีปี2 ในรูปแบบของ
            เว็บแอปพลิเคชัน สำหรับ ความสะดวกให้กับบุคลากร
            ทางด้านสาธารณสุขในการบันทึกข้อมูลที่ได้จากการตรวจคัดกรอง
            เนื่องจากความซับซ้อนของระบบ สารสนเทศ
            ทางด้านสาธารณสุขที่มีปริมาณที่มากเจ้า
            หลายรายในเขตพื้นที่ของกรุงเทพมหานคร ทำให้การ
            รวบรวมข้อมูลสุขภาพสำหรับการบริหารจัดการ
            เพื่อการวางแผนนโยบายสุขภาพจำเป็นต้องอาศัยข้อมูลที่ ถูกต้องมั่นคง
            เชื่อถือได้และ ทันเวลาในการวิเคราะห์
            ซึ่งยังประโยชน์กลับไปสู่ประชาชน รวมถึงการคืนข้อมูล
            การตรวจสุขภาพให้กับประชาชนที่เข้ามาตรวจผ่านทางช่องทางต่างๆ
            โดยใช้ฐานข้อมูลในชุดนี้บนมาตรฐาน ความปลอดภัยที่มีระบบระบุหน่วยงาน
            และ ผู้ใช้งานที่ได้รับมอบหมายที่ชัดเจนต่อไป ทั้งนี้ในการส่งผ่าน
            ข้อมูลสุขภาพที่ได้จัดทำขึ้น
            อาจจะมีการส่งข้อมูลบางส่วนผ่านทางเครือข่าย หรือ
            เครื่องมือที่อยู่ในความ ควบคุมภายใต้สังกัด กรุงเทพมหานคร
            เพื่อเพิ่มช่องทางในการส่งคืนข้อมูลสุขภาพให้กับประชาชนต่อไป
            ทั้งนี้เราดำเนินการเกี่ยวกับการเก็บรวบรวม
            ใช้หรือเปิดเผยข้อมูลส่วนบุคคลของท่าน ดังนี้
          </p>
          <p>
            1. ฐานกฎหมายในการประมวลผลข้อมูลส่วนบุคคล
            เราดำเนินการเก็บรวบรวมข้อมูลส่วนบุคคลของท่านภายใต้ฐาน ดังต่อไปนี้
            1.1 ความจำเป็นในการป้องกันหรือระงับอันตรายต่อชีวิต ร่างกาย
            หรือสุขภาพ เพื่อส่งคืนข้อมูลสุขภาพ
            ให้แก่ผู้ที่เข้าร่วมโครงการเป็นรายบุคคลผ่านทางช่องทางที่ได้แจ้งในขณะที่ได้ตรวจ
            หรือผ่านทางช่องทาง แอปพลิเคชั่น หมอ กทม ที่ได้ 1.2
            ความจำเป็นในการดำเนินงานตามภารกิจสาธารณะหรือการใช้อำนาจรัฐที่เราได้รับภายใต้พ.ร.บ.จัด
            ระเบียบบริหารราชการกรุงเทพฯ พ.ศ.2528
            ซึ่งมีอำนาจและหน้าที่ตามที่กำหนดในพระราชบัญญัติ
            ระเบียบบริหารราชการกรุงเทพมหานคร มาตรา 89 ข้อ 18
          </p>
          <p>
            2. วัตถุประสงค์ในการเก็บรวบรวมข้อมูลส่วนบุคคลของท่าน
            เราดำเนินการเก็บรวบรวมข้อมูลส่วนบุคคลของท่านเพื่อวัตถุประสงค์ดังต่อไปนี้
            2.1 เพื่อจัดทำรายงานสุขภาพในกับท่านในการแนะนำ วางแผนการรักษา 2.2
            เพื่อการวิเคราะห์ข้อมูลในเขตพื้นที่ ความชุกของโรค
            เพื่อการวางแผนในการดำเนินการโครงการ ส่งเสริม ป้องกัน
            อย่างตรงเป้าหมายที่เหมาะสม ตามพื้นที่ 2.3
            เพื่อการจัดบริการการด้านสาธารณสุขให้สอดคล้องกับความชุก
            และข้อมูลสุขภาพที่ปรากฏ 2.4 เพื่อดำเนินการส่งเบิกข้อมูลสุขภาพ
            กับกองทุนสุขภาพหลัก สามกองทุน ได้แก่ กองทุนหลักประกัน
            สุขภาพแห่งชาติกองทุนประกันสังคม
            กองทุนสวัสดิการรักษาพยาบาลข้าราชการ รวมถึงกองทุนสุขภาพ
            ภาครัฐอื่นๆที่สนับสนุนการดำเนินการ
          </p>
          <p>
            3. ข้อมูลส่วนบุคคลที่เราเก็บรวบรวมและใช้
            เพื่อวัตถุประสงค์ตามที่ได้แจ้งในข้อ 2.
            เราเก็บรวบรวมข้อมูลส่วนบุคคลของท่านดังรายการต่อไปนี้
            3.1.แหล่งข้อมูลและรายการข้อมูลส่วนบุคคลที่เก็บรวบรวม มีดังนี้
            แหล่ง/วิธีการเก็บรวบรวม รายการข้อมูลส่วนบุคคล 1.
            เก็บข้อมูลจากท่านโดยตรงผ่าน.. การกรอกแบบสอบถามทั้งใบระบบ กระดาษ
            และ ในรูปแบ บ ข อ ง อิเลคทรอนิกส์ ผ่านทาง web application
            https://health.bangkok.go.th - ชื่อ, นามสกุล,
            เบอร์โทรศัพท์เลขบัตรประจำตัวประชาชน ที่อยู่ อีเมล
            ข้อมูลด้านความเสี่ยงสุขภาพ และ ผลการตรวจต่างๆ รวมถึง คำแนะนำหรือ
            แนวทางในการดูแลต่อเนื่อง 2. ไม่มีการเก็บโดยการใช้เทคโนโลยี
            ตรวจจับหรือติดตามพฤติกรรมการใช้ งานของท่าน 3.
            เก็บข้อมูลจากแหล่งอื่น กรณีมี ความจำเป็นต้องเชื่อมโยง จากระบบ
            อื่นๆของภายใต้สังกัดหน่วยงาน ทางด้านสาธารณสุขภายใต้กำกับของ
            กรุงเทพมหานคร - ชื่อ, นามสกุล, เบอร์โทรศัพท์เลขบัตรประจำตัวประชาชน
            ที่อยู่ อีเมล ข้อมูลด้านความเสี่ยงสุขภาพ และ ผลการตรวจต่างๆ รวมถึง
            คำแนะนำหรือ แนวทางในการดูแลสุขภาพ
            3.2.จุดประสงค์การใช้งานข้อมูลส่วนบุคคล จุดประสงค์ในการใช้ข้อมูล
            รายการข้อมูลส่วนบุคคลที่ใช้ 1. เพื่อ การคัดกรองภาวะสุขภาพ
            ให้คำแนะนำในการดูแลเฉพาะส่วน บุคคล และ ส่งข้อมูลสุขภาพกลับ
            ให้กับเจ้าของข้อมูลเอง - ชื่อ-นามสกุล
            หมายเลขโทรศัพท์เลขบัตรประจำตัวประชาชน ที่อยู่ผลการตรวจ และ
            คำแนะนำแนวทางในการดูแลสุขภาพ 2. เพื่อสำรวจความเสี่ยงทางด้าน สุขภาพ
            ความตระหนักรู้ด้านเข้าถึง บริการสุขภาพ ความชุกของโรคตาม
            พื้นที่ของประชากร เพื่อการวาง แผนการดำเนินการ ทางนโยบาย
            สุขภาพที่เหมาะสม - ชื่อ-นามสกุล
            หมายเลขโทรศัพท์เลขบัตรประจำตัวประชาชน ที่อยู่
            ข้อมูลสุขภาพที่คัดกรอง 3. เพื่อ การดำเนินการเบิกจ่ายตาม
            สิทธิของกองทุนสุขภาพ - ชื่อ-นามสกุล
            หมายเลขโทรศัพท์เลขบัตรประจำตัวประชาชน ที่อยู่
            ข้อมูลสุขภาพที่คัดกรอง ผลการตรวจ และ คำแนะนำ แนวทางในการดูแลสุขภาพ
            ตามเงื่อนไขของกองทุนสุขภาพ
          </p>
          <p>
            4. การเปิดเผยข้อมูลส่วนบุคคลของท่าน 4.1.
            เราเปิดเผยข้อมูลส่วนบุคคลของท่านต่อบุคคลหรือนิติบุคคลดังต่อไปนี้
            4.1.1. หน่วยงานราชการภายใต้สังกัดกรุงเทพมหานครทางด้านสุขภาพ
            (สำนักการแพทย์ สำนักอนามัย และ มหาวิทยาลัยนวมินทราธิราช) และ
            หน่วยงานทางด้านการวิเคราะห์ข้อมูล (สำนักยุทธศาสตร์และประเมินผล และ
            ผู้บริหารของทางกรุงเทพมหานคร) เพื่อการ วางแผนการส่งต่อ
            ดูแลรักษาอย่างต่อเนื่อง
            รวมถึงการนำข้อมูลเพื่อการวิเคราะห์ข้อมูลสุขภาพ
            ของเขตพื้นที่กรุงเทพมหานคร
            ในการวางแผนนโยบายทางด้านสุขภาพอย่างเหมาะสม 4.1.2.
            สำนักหลักประกันสุขภาพแห่งชาติเพื่อการ
            ยืนยันการคัดกรองและการเบิกค่าใช้จ่ายสำหรับ
            การตรวจคัดกรองตามชุดการตรวจของทางกองทุน 4.2.
            เราไม่เปิดเผยข้อมูลของท่านต่อสาธารณะในรูปแบบของข้อมูลส่วนบุคคล
            แต่จะมีการเปิดเผยข้อมูลที่ ได้มีการวิเคราะห์แล้วเท่านั้น
          </p>
          <p>
            5. สิทธิตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. ๒๕๖๒ ของท่าน
            พระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. ๒๕๖๒
            มีวัตถุประสงค์เพื่อให้ข้อมูลส่วนบุคคลของ
            ท่านอยู่ในความควบคุมของท่านได้มากขึ้น
            โดยท่านสามารถใช้สิทธิตามพระราชบัญญัติคุ้มครองข้อมูลส่วน บุคคล พ.ศ.
            ๒๕๖๒
            เมื่อบทบัญญัติในส่วนที่เกี่ยวกับสิทธิของเจ้าของข้อมูลส่วนบุคคลมีผลใช้บังคับ
            ซึ่งมีรายละเอียดดังต่อไปนี้ 5.1 สิทธิในการเข้าถึง
            รับสำเนาและขอให้เปิดเผยที่มาของข้อมูลส่วนบุคคลของท่านที่เราเก็บรวบรวมอยู่
            เว้นแต่กรณีที่เรามีสิทธิปฏิเสธคำขอของท่านตามกฎหมายหรือคำสั่งศาล
            หรือกรณีที่คำขอของท่าน
            จะมีผลกระทบที่อาจก่อให้เกิดความเสียหายต่อสิทธิและเสรีภาพของบุคคลอื่น
            5.2
            สิทธิในการขอแก้ไขข้อมูลส่วนบุคคลของท่านที่ไม่ถูกต้องหรือไม่ครบถ้วน
            เพื่อให้มีความถูกต้อง เป็นปัจจุบัน
            สมบูรณ์และไม่ก่อให้เกิดความเข้าใจผิด 5.3
            สิทธิในการขอให้ระงับการใช้ข้อมูลส่วนบุคคลของท่านในกรณีหนึ่งกรณีใดดังต่อไปนี้
            5.3.1
            เมื่ออยู่ในช่วงเวลาที่เราทำการตรวจสอบตามคำร้องขอของท่านให้แก้ไขข้อมูลส่วนบุคคลของ
            ท่านให้ถูกต้อง สมบูรณ์และเป็นปัจจุบัน 5.3.2
            ข้อมูลส่วนบุคคลของท่านถูกเก็บรวบรวม
            ใช้หรือเปิดเผยโดยมิชอบด้วยกฎหมาย 5.3.3
            เมื่อข้อมูลส่วนบุคคลของท่านหมดความจำเป็นในการเก็บรักษาไว้ตามวัตถุประสงค์เราได้แจ้ง
            ไว้ในการเก็บรวบรวม
            แต่ท่านประสงค์ให้เราเก็บรักษาข้อมูลนั้นต่อไปเพื่อประกอบการใช้สิทธิ
            ตามกฎหมายของท่าน 5.3.4
            เมื่ออยู่ในช่วงเวลาที่เรากำลังพิสูจน์ให้ท่านเห็นถึงเหตุอันชอบด้วยกฎหมายในการเก็บ
            รวบรวมข้อมูลส่วนบุคคลของท่าน หรือตรวจสอบความจำเป็นในการเก็บรวบรวม
            ใช้หรือ เปิดเผยข้อมูลส่วนบุคคลของท่านเพื่อประโยชน์สาธารณะ
            อันเนื่องมาจากการที่ท่านได้ใช้สิทธิ คัดค้านการเก็บรวบรวม
            ใช้หรือเปิดเผยข้อมูลส่วนบุคคลของท่าน 5.4
            สิทธิในการคัดค้านการเก็บรวบรวม
            ใช้หรือเปิดเผยข้อมูลส่วนบุคคลของท่าน เว้นแต่กรณีที่เรามี
            เหตุในการปฏิเสธคำขอของท่านโดยชอบด้วยกฎหมาย (เช่น
            เราสามารถแสดงให้เห็นว่าการเก็บ รวบรวม
            ใช้หรือเปิดเผยข้อมูลส่วนบุคคลของท่านมีเหตุอันชอบด้วยกฎหมายยิ่งกว่า
            หรือเพื่อการ ก่อตั้งสิทธิเรียกร้องตามกฎหมาย
            การปฏิบัติตามหรือการใช้สิทธิเรียกร้องทางกฎหมาย หรือเพื่อ
            ประโยชน์สาธารณะตามภารกิจของเรา)
          </p>
          <p>
            6. ระยะเวลาในการเก็บรักษาข้อมูลส่วนบุคคล
            เราเก็บรักษาข้อมูลส่วนบุคคลของท่าน เป็นระยะเวลา 6 ปีนับจาก
            เป็นปีพุทธศักราชที่มีการบันทึก ข้อมูลจนสมบูรณ์ในระบบ
            โดยระยะเวลาดังกล่าวเป็นไปตามมาตรฐานที่กำหนดเวชระเบียนโดยทั่วไปตาม
            คำแนะนำของแพทยสภา ตามการประชุมของคณะกรรมการแพทยสภาเมื่อวันที่ 4
            กุมภาพันธ์2542 ที่ต้อง เก็บไม่ต่ำกว่า 5
            ปีนับตั้งแต่ที่การติดต่อครั้งสุดท้าย
            ทั้งนี้เมื่อพ้นระยะเวลาดังกล่าวเราจะทำการ -
            ทำให้ข้อมูลส่วนบุคคลของท่านไม่สามารถระบุตัวตนได้เพื่อการใช้ประโยชน์ด้านอื่น
            เช่น การวิเคราะห์ ทางสถิติการปรับปรุงประสิทธิภาพการทำงาน
            หรือประโยชน์สาธารณะที่สำคัญ
          </p>
          <p>
            7. การรักษาความมั่นคงปลอดภัยข้อมูลส่วนบุคคล
            เรามีมาตรการในการรักษาความมั่นคงปลอดภัยข้อมูลส่วนบุคคลของท่านอย่างเหมาะสม
            ทั้งในเชิงเทคนิค และการบริหารจัดการ เพื่อป้องกันมิให้ข้อมูลสูญหาย
            หรือมีการเข้าถึง ทำลาย ใช้เปลี่ยนแปลง แก้ไข หรือ
            เปิดเผยข้อมูลส่วนบุคคลโดยไม่ได้รับอนุญาต
            ซึ่งสอดคล้องกับนโยบายและแนวปฏิบัติด้านความมั่นคงปลอดภัย สารสนเทศ
            (Information Security Policy) ของเรา
            นอกจากนี้เราได้กำหนดให้มีนโยบายการคุ้มครองข้อมูลส่วนบุคคลขึ้นโดยประกาศให้ทราบกันโดยทั่วทั้ง
            องค์กร
            พร้อมแนวทางปฏิบัติเพื่อให้เกิดความมั่นคงปลอดภัยในการเก็บรวบรวม
            ใช้และเปิดเผยข้อมูลส่วน บุคคล โดยธำรงไว้ซึ่งความเป็นความลับ
            (Confidentiality) ความถูกต้องครบถ้วน (Integrity) และสภาพ
            พร้อมใช้งาน (Availability) ของข้อมูลส่วนบุคคล
            โดยเราได้จัดให้มีการทบทวนนโยบายดังกล่าวรวมถึง
            ประกาศนี้ในระยะเวลาตามที่เหมาะสม
          </p>
          <p>
            8. การมีส่วนร่วมของเจ้าของข้อมูลส่วนบุคคล
            เราอาจเปิดเผยข้อมูลส่วนบุคคลก็ต่อเมื่อได้รับคำร้องขอจากเจ้าของข้อมูลส่วนบุคคล
            ผู้สืบสิทธิ์ทายาท ผู้แทนโดยชอบธรรม
            หรือผู้อนุบาลหรือผู้พิทักษ์ตามกฎหมาย โดยส่งคำร้องขอผ่าน
            โรงพยาบาลราชพิพัฒน์ ทางจดหมายอิเล็กทรอนิกส์
            saraban.msd.rpphosp@bangkok.go.th ในกรณีที่เจ้าของข้อมูล
            ผู้สืบสิทธิ์ทายาท ผู้แทนโดยชอบธรรม
            หรือผู้พิทักษ์ตามกฎหมายมีการคัดค้าน การจัดเก็บ ความถูกต้อง
            หรือการกระทำใด ๆ เช่น การแจ้งดำเนินการปรับปรุงแก้ไขข้อมูลส่วนบุคคล
            เราจะ ดำเนินการบันทึกหลักฐานคำคัดค้านดังกล่าวไว้เป็นหลักฐานด้วย
            ทั้งนี้เราอาจปฏิเสธสิทธิตามวรรคสองได้ตามกรณีที่มีกฎหมายกำหนด
            หรือในกรณีที่ข้อมูลส่วนบุคคลของ
            ท่านถูกทำให้ไม่ปรากฏชื่อหรือสิ่งบอกลักษณะอันสามารถระบุตัวท่านได้
          </p>
          <p>
            9. ความรับผิดชอบของบุคคลซึ่งประมวลผลข้อมูลส่วนบุคคล
            เราได้กำหนดให้เจ้าหน้าที่เฉพาะผู้ที่มีอำนาจหน้าที่เกี่ยวข้องในการจัดเก็บรวบรวม
            ใช้และเปิดเผยข้อมูล
            ส่วนบุคคลของกิจกรรมการประมวลผลนี้เท่านั้นที่จะสามารถเข้าถึงข้อมูลส่วนบุคคลของท่านได้โดยเราจะ
            ดำเนินการให้เจ้าหน้าที่ปฏิบัติตามประกาศนี้อย่างเคร่งครัด
          </p>
          <p>
            10. การเปลี่ยนแปลงแก้ไขคำประกาศเกี่ยวกับความเป็นส่วนตัว
            ในการปรับปรุงหรือเปลี่ยนแปลงประกาศนี้เราอาจพิจารณาแก้ไขเปลี่ยนแปลงตามที่เห็นสมควร
            และจะ ทำการแจ้งให้ท่านทราบผ่านช่องทาง เวปไซค์โรงพยาบาลราชพิพัฒน์
            https://www.rpphosp.go.th โดยมี
            วันที่ของเวอร์ชั่นฉบับปรับปรุงครั้งที่ 1 ล่าสุดกำกับอยู่ตอนท้าย
            อย่างไรก็ดีเราขอแนะนำให้ท่านโปรด
            ตรวจสอบเพื่อรับทราบประกาศฉบับใหม่อย่างสม่ำเสมอ
            โดยเฉพาะก่อนที่ท่านจะเปิดเผยข้อมูลส่วนบุคคลแก่ เรา
            โดยในการเข้าใช้งานผลิตภัณฑ์หรือบริการภายใต้กิจกรรมการประมวลผลนี้ของท่าน
            ถือเป็นการรับทราบ
            ตามข้อตกลงในประกาศนี้ทั้งนี้โปรดหยุดการใช้งานหากท่านไม่เห็นด้วยกับข้อตกลงในประกาศฉบับนี้หาก
            ท่านยังคงใช้งานต่อไปภายหลังจากที่ประกาศนี้มีการแก้ไขและนำขึ้นประกาศในช่องทางข้างต้นแล้ว
            จะถือว่า ท่านได้รับทราบการเปลี่ยนแปลงดังกล่าวแล้ว
          </p>
          <p>
            11. การติดต่อสอบถาม
            ท่านสามารถติดต่อสอบถามเกี่ยวกับประกาศฉบับนี้ได้ที่
            11.1 ผู้ควบคุมข้อมูลส่วนบุคคล (Data Controller) -
            ผู้อำนวยการโรงพยาบาลราชพิพัฒน์ - สถานที่ติดต่อ: สำนักงานผู้บริหาร
            ชั้น 5 อาคารสมเด็จพระสังฆราช เลขที่ 18 ถนนพุทธมณฑล สาย 3 ซอย 10
            แขวงบางไผ่ เขตบางแค กทม. 10160 - ช่องทางการติดต่อ: 02 102 4222 /
            Line Official ID = @1rpp - Email =
            saraban.msd.rpphosp@bangkok.go.th
            11.2 เจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล (Data Protection Officer: DPO)
            - หัวหน้าฝ่ายวิชาการและแผนงาน - สถานที่ติดต่อ:
            ฝ่ายวิชาการและแผนงานชั้น 3 อาคารเฉลิมพระเกียรติเลขที่ 18 ถนนพุทธ
            มณฑลสาย 3 ซอย 10 แขวงบางไผ่ เขตบางแค กทม. 10160 -
            ช่องทางการติดต่อ: 02 102 4222 / Line Official ID = @1rpp - Email =
            saraban.msd.rpphosp@bangkok.go.th
          </p>
        </CardBody>
      </Card>
      <Checkbox checked={agree} onChange={() => setAgree(!agree)} radius="none" size="sm" color="primary" className="text-left">
        รับทราบและยอมรับ ทั้งนโยบายความเป็นส่วนตัว
        และเงื่อนไขและข้อตกลงการใช้บริการ
      </Checkbox>
      <div className="flex flex-row gap-5 w-full">
        <Button variant="solid" radius="full" className="w-full" onPress={() => router.push("/")}>ไม่ยินยอม</Button>
        <Button isDisabled={!agree} color="primary" variant="solid" radius="full" className="w-full" onPress={() => router.push("/register")}>ยินยอม</Button>
      </div>
    </div>
  );
}
