export const qPhqa = [
  "รู้สึกเศร้า หงุดหงิด หรือสิ้นหวัง",
  "เบื่อ ไม่ค่อยสนใจหรือไม่เพลิดเพลินเวลาทำสิ่งต่างๆ",
  "นอนหลับยาก รู้สึกง่วงทั้งวัน หรือนอนมากเกินไป",
  "ไม่อยากอาาหาร น้ำหนักลด หรือกินมากกว่าปกติ",
  "รู้สึกเหนื่อยล้า ไม่ค่อยมีพลัง",
  "รู้สึกแย่กับตัวเอง หรือรู้สึกว่าตัวเองล้มเหลวหรือทำให้ตัวเองหรือครอบครัวผิดหวัง",
  "จดจ่อกับสิ่งต่างๆได้ยากเช่น ทำการบ้าน อ่านหนังสือหรือดูโทรทัศน์",
  "พูดหรือทำอะไรช้าลงจนคนอื่นสังเกตเห็นได้ กระวนกระวาย จนต้องเคลื่อนไหวไปมา มากกว่าปกติ",
  "คิดว่าถ้าตายไปเสียจะดีว่า หรือคิดจะทำร้ายตัวเอง ด้วยวิธีใดวิธีหนึ่ง",
];

export const qPhqa_addon = [
  "ใน 1 เดือนที่ผ่านมา มีช่วงไหนที่คุณมีความคิด อยากตาย หรือไม่อยากมีชีวิตอยู่ อย่างจริงจังหรือไม่",
  "ตลอดชีวิตที่ผ่านมา คุณเคยพยายามที่จะทำให้ตัวเองตาย หรือลงมือฆ่าตัวตายหรือไม",
];

export const q2 = [
  "ใน 1 เดือนที่ผ่านมา มีช่วงไหนที่คุณมีความคิด อยากตาย หรือไม่อยากมีชีวิตอยู่ อย่างจริงจังหรือไม่",
  "ตลอดชีวิตที่ผ่านมา คุณเคยพยายามที่จะทำให้ตัวเองตาย หรือลงมือฆ่าตัวตายหรือไม",
];
