import { title } from "@/components/primitives"

export const Step1 = () => {
    return (
        <div className="text-start flex flex-col gap-5 text-sm">
            <h2 className={title({ size: "xs" })}>ข้อกำหนดและเงื่อนไข</h2>
            <div className="flex flex-col gap-3">
                <span className="font-semibold">1. นิยาม (Definition)</span>
                <p><span className="font-semibold">เซสชั่น</span> คือการให้บริการต่อหน่วย 30 นาที ซึ่ง 1 เซสชั่น นับเป็น 30 นาที</p>
                <p><span className="font-semibold">ข้อมูลส่วนตัว</span> หมายถึง ข้อมูลส่วนตัวของผู้ใช้งานที่ใช้ระบุตัวบุคคล เช่น ชื่อ-นามสกุล รหัสประจำตัวประชาชน ที่อยู่ อีเมล เบอร์โทรศัพท์ เป็นต้น หรือข้อมูลอื่น ๆ ที่เกี่ยวข้องกับผู้ใช้</p>
                <p><span className="font-semibold">ข้อมูลสุขภาพ </span> หมายถึง ข้อมูลส่วนตัวผู้ใช้เกี่ยวกับสุขภาพหรือข้อมูลทางการแพทย์</p>
                <p><span className="font-semibold">ข้อมูลไม่ระบุตัวผู้ใช้  </span> หมายถึง ข้อมูลเกี่ยวกับผู้ใช้ที่ไม่สามารถใช้ระบุตัวผู้ใช้ได้ มีการถอด PII (Personally identifiable information) ออกไป</p>
                <p><span className="font-semibold">คุกกี้ </span> คือข้อมูลที่ได้ส่งจาก Site ไปยังเครื่องคอมพิวเตอร์ของ ผู้ใช้ในขณะที่ผู้ใช้เข้าเยี่ยมชมเว็บไซต์นั้นกำลังเข้าเยี่ยมชมเว็บไซต์ของโรงพยาบาลราชพิพัฒน์</p>
                <p className="indent-8">ท่านจำเป็นต้องทำความเข้าใจ ตกลงผูกพัน และยินยอมปฏิบัติตามข้อกำหนดและเงื่อนไขการใช้บริการฉบับนี้ (”เงื่อนไขการใช้บริการ”)อย่างเคร่งครัด</p>
                <p className="indent-8">กรณีที่คุณไม่ตกลงยินยอมในเงื่อนไขการใช้บริการดังกล่าว คุณจะไม่สามารถใช้บริการนี้ได้ หากคุณละเมิด หรือ ไม่ปฏิบัติ ตามเงื่อนไขการใช้บริการไม่ว่าข้อหนึ่งข้อใด โรงพยาบาลราชพิพัฒน์มีสิทธิยกเลิกบัญชีผู้ใช้ของท่านได้ทันทีโดยไม่ต้องแจ้งให้ท่านทราบล่วงหน้า และโรงพยาบาลราชพิพัฒน์สงวนสิทธิ์ในการไม่คืนเงินที่ท่านได้ชำระเรียบร้อยแล้ว เว้นแต่บริกาารนั้นๆเราได้กำหนดนโยบายและเงื่อนไขการคืนเงินหรือคืนสินค้าให้กับท่านอย่างชัดแจ้ง อย่างไรก็ตามเราไม่มีหน้าที่ต้องชดใช้ค่าสินไหมทดแทนใดๆให้แก่คุณไม่ว่ากรณีใดๆทั้งสิ้น</p>
            </div>
            <div className="flex flex-col gap-3">
                <span className="font-semibold">2. การให้บริการทางสุขภาพ (Health care Service)</span>
                <p className="indent-8">โรงพยาบาลราชพิพัฒน์ดำเนินการภายใต้ชื่อ “Teen Mind” และให้บริการทางการแพทย์ทางไกล (Telemedicine) ผ่านแอปพลิเคชัน แพทย์ และผู้ให้คำปรึกษาที่ให้บริการผ่านแอปพลิเคชัน หมอกทม นั้น เป็นผู้ประกอบวิชาชีพทางทางเวชกรรม หรือผู้ให้คำปรึกษาที่ได้รับใบอนุญาต ในการให้บริการด้านสุขภาพผ่านบริการทางการแพทย์ทางไกล</p>
                <p className="indent-8">แพทย์และผู้ให้คำปรึกษาผ่านแอปพลิเคชันทุกท่าน ไม่ได้เป็นลูกจ้างหรือบุคคลที่โรงพยาบาลราชพิพัฒน์จ้างวานมาเพื่อให้บริการแก่ท่านโดยตรง แพทย์และผู้ให้คำปรึกษาทุกท่าน เป็นผู้เลือกประกอบวิชาชีพเวชกรรมหรือให้คำแนะนำผ่านแอปพลิเคชัน Teen Mind อย่างอิสระ เพื่อให้คำปรึกษาแนะนำเกี่ยวกับปัญหาสุขภาพหรือให้แนวทางการรักษา ในบางกรณีแก่ผู้รับคำแนะนำ ซึ่งแพทย์และผู้ให้คำปรึกษาแต่ละท่านจะเป็นผู้รับผิดชอบต่อการให้คำแนะนำและการร้องเรียนของผู้รับคำแนะนำแต่ละท่านเอง โรงพยาบาลราชพิพัฒน์หรือบุคคลภายนอกที่นำเสนอบริการ หรือจัดหาลิงก์ (link) นั้น ไม่มีผลผูกพันต่อคำแนะนำใดๆ ที่ท่านได้รับจากแพทย์หรือผู้ให้คำปรึกษา</p>
                <p className="indent-8">โรงพยาบาลราชพิพัฒน์จะไม่มีการแทรกแซงในการปฏิบัติทางการแพทย์ของแพทย์ หรือการให้คำปรึกษาผู้ให้คำปรึกษา แพทย์และผู้ให้คำปรึกษาแต่ละท่านจะเป็นผู้รับผิดชอบในคำแนะนำเกี่ยวกับการรักษา และการแนะนำการรักษาและการร้องเรียนจากผู้ป่วยหรือผู้รับคำปรึกษา</p>
            </div>
            <div className="flex flex-col gap-3">
                <span className="font-semibold">3. เนื้อหาในแอปพลิเคชัน (Site Content)</span>
                <p className="indent-8">ไม่มีเนื้อหาอื่นใดในแอปพลิเคชัน(นอกเหนือจากคำแนะนำที่ได้รับจากแพทย์หรือผู้ให้คำปรึกษา) ที่นับเป็นคำแนะนำทางการแพทย์ หรือเป็นการรับประกัน หรือการสนับสนุนว่า ยาหรือการรักษาใดๆ นั้นปลอดภัยและได้ผลสำหรับท่าน</p>
            </div>
            <div className="flex flex-col gap-3">
                <span className="font-semibold">4. การยินยอมเข้ารับบริการ (Inform Consent)</span>
                <p><span className="font-semibold">ก. </span> การแพทย์ทางไกล (Telehealth) คือการให้บริการทางสุขภาพโดยใช้เทคโนโลยีโต้ตอบทางภาพเคลื่อนไหวและเสียงโดยผู้ป่วย และบุคลากรทางการแพทย์นั้นไม่ได้อยู่ในสถานที่ทางกายภาพเดียวกัน ระหว่างการให้คำปรึกษาสุขภาพทางไกล ท่านอาจต้องให้ข้อมูลสนทนาเกี่ยวกับรายละเอียดของประวัติทาง สุขภาพและประวัติส่วนตัวของท่าน ผ่านการโต้ตอบผ่านภาพเคลื่อนไหวและเสียง หรือเทคโนโลยีทางการสื่อสารทางไกลอื่นๆ และ แพทย์หรือผู้ให้คำปรึกษานั้น อาจซักประวัติหรือสังเกตหรือขอให้ท่านตรวจร่างกายตนเอง เพื่อประกอบการวินิจฉัยและให้คำแนะนำผ่านเทคโนโลยีดังกล่าว</p>
                <p><span className="font-semibold">ข. </span> การรับคำแนะนำทางสุขภาพทางไกลจากผู้ให้คำปรึกษาจากกลุ่ม แพทย์หรือผู้ให้คำปรึกษานั้น ไม่สามารถแทนที่การพบแพทย์ที่สถานพยาบาล หรือแทนที่การรักษาอย่างต่อเนื่องกับแพทย์ที่รักษาประจำได้</p>
                <p className="indent-8">ท่านอาจเข้ารับการให้คำแนะนำต่อเนื่องกับแพทย์หรือผู้ให้คำปรึกษาบางท่านผ่านแอปพลิเคชัน ซึ่งในการเข้าพบครั้งแรกกับผู้ให้คำปรึกษาเป็นเพียงการเริ่มการรับคำปรึกษา (เพื่อพิจารณา แนวทางในการรักษาที่เหมาะสมที่สุดในการดูแลสำหรับท่าน) และไม่จำเป็นจะต้องพบแพทย์ต่อเนื่องผ่านแอปพลิเคชันเสมอไป แพทย์หรือผู้ให้คำปรึกษาผ่านแอปพลิเคชันอาจแนะนำให้ผู้รับคำแนะนำ มองหาความช่วยเหลือทางการแพทย์ฉุกเฉิน การตรวจติดตามการรักษาจากแพทย์ที่สถานพยาบาล หรือไปตรวจรักษากับแพทย์ที่สถานพยาบาล ซึ่งผู้รับคำแนะนำควรปฏิบัติตามคำแนะนำดังกล่าวเพื่อความปลอดภัยของผู้รับคำแนะนำ</p>
                <p className="indent-8">โรงพยาบาลราชพิพัฒน์อาจทำการนัดหมายสำหรับการตรวจติดตาม ผ่านแอปพลิเคชัน หรือช่องทางอื่นที่ท่านได้ระบุไว้ ท่านอาจจะได้รับการติดต่อจากฝ่ายสนับสนุนบริการลูกค้า (Customer Support Service) เพื่อติดตามผลหลังจากการได้รับการรักษา ผลข้างเคียง หรือผลแทรกซ้อนอื่นๆ ซึ่งประโยชน์ของการใช้แอปพลิเคชัน คือการเพิ่มความสามารถในการเข้าถึงกลุ่มวิชาชีพทางการแพทย์และอำนวยความสะดวกสบายให้แก่ท่าน แต่อย่างไรก็ตาม การให้บริการทางการแพทย์ทางไกลนั้น มีความเสี่ยงเช่นเดียวกันกับการให้การบริการทางสุขภาพอื่นๆ และความเสี่ยงที่อาจเกิดขึ้น อาจเป็นข้อจำกัดทางเทคนิค อันได้แก่</p>
                <p className="indent-8"><span className="font-semibold">o</span> ข้อมูลที่ส่งต่อนั้นไม่เพียงพอ (เช่น ความคมชัดของภาพไม่เพียงพอ) ที่จะสามารถช่วยให้ท่านตัดสินใจในการรับการรักษาได้ </p>
                <p className="indent-8"><span className="font-semibold">o</span> ความล่าช้าของสัญญาณ หรือการขาดช่วงของสัญญาณ ที่ทำให้สัญญาณหลุดหรือสื่อสารไม่ได้ ซึ่งสามารถเกิดได้จากความผิดปกติของเครื่องมืออิเล็กทรอนิกส์ ถ้าเหตุการณ์เหล่านี้เกิดขึ้น ท่านอาจได้รับการติดต่อผ่านโทรศัพท์หรืออีเมล จากทีม Customer Support Service เพื่อช่วยเหลือ หรือ การสื่อสารผ่านช่องทางอื่นๆ ในทางกลับกันท่านสามารถแจ้งเรื่อง เพื่อขอความช่วยเหลือได้ผ่าน Customer Support Service ผ่านทางอีเมล support@ooca.co ระบบแชท หรือโทรศัพท์ ได้เช่นเดียวกัน</p>
                <p className="indent-8"><span className="font-semibold">o</span> ข้อจำกัดในการรับทราบประวัติทางการแพทย์ของท่าน อาจจะส่งผลให้การแนะนำที่ปราศจากประวัติข้อมูลทางการแพทย์ของท่านผิดพลาด และอาจส่งผลให้ท่านเกิดอาการแพ้ยา หรือมีผลแทรกซ้อน หรือเกิดความผิดพลาดอื่นๆ ได้ </p>
                <p className="indent-8"><span className="font-semibold">o</span> ถึงแม้ว่าโรงพยาบาลราชพิพัฒน์จะมีมาตรการป้องกันความเป็นส่วนตัวและความ ปลอดภัยของข้อมูลผู้ป่วย แต่ในบางกรณี มาตรการนั้นอาจล้มเหลว ทำให้เกิดการรั่วไหลของข้อมูลได้ </p>
                <p><span className="font-semibold">ค. </span> การยอมรับข้อตกลงและเงื่อนไขดังกล่าว ท่านรับทราบและเข้าใจและยอมรับว่า: ท่านเข้าใจว่าท่านสามารถคาดหวังประโยชน์จากการใช้แอปพลิเคชัน แต่ไม่มีการรับรองผลใดๆ ท่านเข้าใจว่า กฎหมายและข้อบังคับที่คุ้มครองความเป็นส่วนตัวและความปลอดภัยของข้อมูลทางสุขภาพนั้น สามารถใช้กับการให้บริการทางแพทย์ทางไกลได้ และได้รับจดหมายเตือนเกี่ยวกับความเป็นส่วนตัวจากทางโรงพยาบาลราชพิพัฒน์แล้ว ข้อมูลการสื่อสารอิเล็กทรอนิกส์และประวัติการรักษาจะผ่านการเข้ารหัสความปลอดภัยเสมอ ถ้าประกันสุขภาพของท่านไม่สามารถครอบคลุมค่าใช้จ่ายที่เกิดขึ้นผ่านการให้บริการ ท่านต้องรับผิดชอบต่อค่าใช้จ่ายนั้น แพทย์/ผู้ให้คำปรึกษาอาจพิจารณาว่าการให้บริการผ่าน แอปพลิเคชันนั้น ไม่เหมาะสมกับการรักษาภาวะเจ็บป่วยของท่าน และอาจเลือกที่จะไม่ให้บริการแก่ท่านผ่านแอปพลิเคชัน ในการรักษาจิตบำบัด ท่านจะได้รับข้อมูลเกี่ยวกับวิธีการรักษา ระยะเวลาของการรักษา(ถ้าทราบ) และค่าใช้จ่าย ถ้าท่านสามารถขอความเห็นจากจิตแพทย์หรือนักจิตวิทยาท่านอื่นหรือสิ้นสุดการรักษาได้เสมอ</p>
                <p><span className="font-semibold">ง. </span> ท่านสามารถส่งข้อความไปยังแพทย์หรือผู้ให้คำปรึกษาของท่าน ผ่านทางฝ่ายสนับสนุนบริการลูกค้า (Customer Support Service) ซึ่งแพทย์/ผู้ให้คำปรึกษาไม่อาจจะตอบกลับข้อความ ได้ทันที หากท่านมีภาวะฉุกเฉินหรือต้องการความช่วยเหลือฉุกเฉิน กรุณาติดต่อ 1669 หรือสถานพยาบาลที่ใกล้ที่สุด</p>
            </div>
            <div className="flex flex-col gap-3">
                <span className="font-semibold">5. ความเป็นส่วนตัว</span>
                <p className="indent-8">โรงพยาบาลราชพิพัฒน์ให้ความสำคัญกับความปลอดภัยของข้อมูลผู้ใช้ที่ต้อง ปกปิดเป็นความลับ โดยมีแนวทางในการปกปิดข้อมูลตามนโยบายความเป็นส่วนตัว (Privacy Policy) ที่โรงพยาบาลราชพิพัฒน์ในประกาศไว้ โดยโรงพยาบาลราชพิพัฒน์จะใช้ความระมัดระวังเกี่ยวกับมาตรการรักษาความ ปลอดภัยของโรงพยาบาลราชพิพัฒน์ เพื่อให้มีการรักษาความปลอดภัยของ ข้อมูลใดๆ ของผู้ใช้</p>
            </div>
            <div className="flex flex-col gap-3">
                <span className="font-semibold">6. บัญชีผู้ใช้</span>
                <p className="indent-8">ท่านต้องสร้างบัญชีผู้ใช้เพื่อเข้าใช้แอปพลิเคชัน ในการลงทะเบียนท่านจำเป็นต้องกรอก ชื่อ นามสกุล, อีเมล, รหัสผ่าน และข้อมูลอื่นๆ ที่เกี่ยวข้อง (ต่อไปนี้เรียกว่า “ข้อมูลบัญชี”) โดยในการสร้างบัญชีท่านต้องบรรลุนิติภาวะ ผู้ที่ยังไม่บรรลุนิติภาวะไม่อนุญาตให้สร้างบัญชีเองได้ ท่านต้องรับรองว่าข้อมูลผู้ใช้ของท่านเป็นข้อมูลจริง ถูกต้อง และสมบูรณ์ทุกครั้งที่ท่านเข้าใช้แอปพลิเคชัน ท่านจะต้องไม่เปิดเผยหรือแบ่งปันรหัสผ่านของท่านให้กับผู้อื่น และต้องรักษารหัสผ่านของท่าน เพื่อให้มั่นใจได้ว่าจะไม่มีใครสามารถเข้าบัญชีในชื่อของท่านได้ นอกจากท่าน โรงพยาบาลราชพิพัฒน์จะไม่สามารถเข้าบัญชีหรือนำข้อมูลผู้ใช้ของท่านไปใช้ เพื่อประโยชน์การอื่นที่ไม่เกี่ยวข้องกับแอปพลิเคชันได้</p>
            </div>
            <div className="flex flex-col gap-3">
                <span className="font-semibold">7. การให้บริการแก่ผู้ที่ยังไม่บรรลุนิติภาวะ</span>
                <p className="indent-8">ผู้ที่ยังไม่บรรลุนิติภาวะ (อายุน้อยกว่า 15 ปีถ้วน) สามารถใช้แอปพลิเคชันได้ภายใต้การดูแลและการให้คำยินยอมจากผู้ปกครองหรือผู้แทนโดยชอบธรรม โดยผู้ปกครองหรือผู้แทนโดยชอบธรรม ต้องเป็นผู้รับผิดชอบในการสร้างบัญชีผู้ใช้ ยอมรับและให้คำยินยอมตามข้อกำหนดและเงื่อนไข รวมถึงเข้าร่วมการสนทนาพร้อมกันแก่ผู้ยังไม่บรรลุนิติภาวะ</p>
            </div>
            <div className="flex flex-col gap-3">
                <span className="font-semibold">8. สิทธิ์การเข้าใช้</span>
                <p className="indent-8">โรงพยาบาลราชพิพัฒน์ขอสงวนสิทธิ์การเข้าใช้ให้เฉพาะแก่ท่านที่ให้ข้อมูลและลงทะเบียนสร้างบัญชีผู้ใช้แอปพลิเคชันเท่านั้น โรงพยาบาลราชพิพัฒน์ขอสงวนสิทธิ์ในการยกเลิกหรือปฎิเสธการให้บริการแก่ท่านไม่ว่าด้วยเหตุผลใด ท่านจะไม่ปฏิบัติหรือพยายามที่จะกระทำการใดดังต่อไปนี้</p>
                <p className="indent-8"><span className="font-semibold">ก. </span> ปลอมแปลงหรือบิดเบือนข้อมูลเพื่อสวมรอยเป็นบุคคลอื่นหรือ ทำให้เข้าใจว่าตนเป็นบุคคลอื่น</p>
                <p className="indent-8"><span className="font-semibold">ข. </span> ใช้แอปพลิเคชันเพื่อกระทำผิดกฎหมายหรือกฎระเบียบของสังคม</p>
                <p className="indent-8"><span className="font-semibold">ค. </span> คัดลอก ดัดแปลง แก้ไข ปรับปรุงแอปพลิเคชันหรือส่วนใดส่วนหนึ่งของแอปพลิเคชัน</p>
                <p className="indent-8"><span className="font-semibold">ง. </span> เผยแพร่หรือใช้แอปพลิเคชันในการกระจายไวรัสหรือข้อมูลที่ไม่ปลอดภัย</p>
                <p className="indent-8"><span className="font-semibold">จ. </span> การกระทำใดๆ ที่นอกเหนือไปจากการใช้งานโดยทั่วไปตาม วัตถุประสงค์ที่โรงพยาบาลราชพิพัฒน์ระบุไว้ หรือไม่ปฎิบัติข้อตกลงและเงื่อนไขในการให้บริการนั้นๆ </p>
                <p className="indent-8">นอกจากนี้ท่านจะต้องไม่กระทำพฤติกรรมหรือคำพูดไม่เหมาะสม, รุนแรง, ผิดศีลธรรมอันดีของสังคมหรือกฎหมาย ทางโรงพยาบาลราชพิพัฒน์จะไม่รับผิดชอบการกระทำใดๆ ของท่านที่เกิดขึ้นระหว่างการใช้แอปพลิเคชัน โรงพยาบาลราชพิพัฒน์ไม่แนะนำอย่างยิ่งในการใช้งานแอปพลิเคชันผ่านคอมพิวเตอร์หรืออุปกรณ์สาธารณะ และไม่แนะนำให้เก็บหรือจดจำข้อมูลผู้ใช้โดยเฉพาะรหัสผ่านในเว็บบราวเซอร์หรือโปรแกรมอื่นๆ
                </p>
            </div>
        </div>
    )
}