export const Step1 = () => {
  return (
    <div className="text-start flex flex-col gap-5 text-sm">
      <div className="flex flex-col gap-3">
<<<<<<< HEAD
        <span className="font-semibold">
          ประกาศความเป็นส่วนตัวสำหรับแอปประเมินสุขภาพจิต
        </span>
        <div className="flex flex-col indent-8 gap-3">
          <p>
            <span className="font-semibold">ข้อมูลส่วนตัว</span>{" "}
            วัตถุประสงค์ของการประมวลผลข้อมูลส่วนบุคคล
            เพื่อการนำข้อมูลส่วนบุคคลไปใช้หรือเปิดเผย โรงพยาบาลราชพิพัฒน์
            สำนักการแพทย์ กรุงเทพมหานคร ในฐานะเป็นโรงพยาบาลรับส่งต่อ และ
            จัดการระบบสุขภาพในพื้นที่กรุงเทพมหานครที่ 1 (Health zone1)
            ประกอบด้วย พื้นที่เขต บางแค ภาษีเจริญ หนองแขม ทวีวัฒนา ตลิ่งชัน
            ซึ่งพบว่าเกิดปัญหาทางด้านความเครียดในเขตพื้นที่รับผิดชอบ
            จึงได้ทำเครื่องมือเพื่อให้มีการคัดกรองความเครียดให้กับประชาชนในพื้นที่ได้ใช้บริการ
            รวมถึงจัดหาระบบการส่งต่อที่เหมาะสมให้แก่ผู้เชี่ยวชาญทางด้านให้คำปรึกษาทางจิตในกรณีที่ตรวจคัดกรองพบความเสี่ยงที่จะเกิดโรคซึมเศร้า
            ลักษณะของการเกี่ยวข้อมูลส่วนบุคคลเพื่อให้มีข้อมูลเพียงพอกับการประเมินตามเครื่องมือ
            รวมถึงข้อมูลคำถามประกอบอื่นๆ
            เพื่อใช้ในการติดตามส่งต่อในกรณีที่มีความเสี่ยงต่อภาวะซึมเศร้า
            ในกรณีที่เป็นผู้เยาว์จำเป็นต้องได้รับการดูแลและแจ้งผู้ปกครอง หรือ
            ผู้แทนอันชอบธรรมในการให้ข้อมูลก่อน
          </p>

          <p className="indent-8">
            ในการประกาศเชิญชวนในวงกว้างสำหรับผู้ที่ยังไม่บรรลุนิติภาวะ
            จำเป็นจะต้องประกาศเชิญชวนผ่านทางผู้แทนของบุคคลนั้นโดยในผู้เยาว์ได้สามารถให้ข้อมูลตามความเห็นของตัวเองได้
            ถ้าท่านมีความไม่สะดวก หรือ
            สงสัยควรถามให้สิ้นสงสัยก่อนที่จะดำเนินการต่อ
            ในกรณีที่ไม่สะดวกในการให้ข้อมูล
            และไม่สามารถเปิดเผยต่อผู้เชี่ยวชาญทางด้านให้คำปรึกษาทางจิตได้
            เมื่อท่านไม่ควรดำเนินการต่อ
          </p>

          <p>
            <span className="font-semibold">
              1.ข้อมูลที่จะถูกบันทึกเพื่อดำเนินการต่อ{" "}
            </span>{" "}
            ชื่อ นามสกุล เพศ อายุ เลขบัตรประจำตัวประชาชน สถานที่ศึกษา
            ชั้นที่ศึกษา ช่องทางการติดต่อกลับ ได้แก่ LineID(การเชื่อมต่อทางline)
            เบอร์โทรศัพท์ส่วนตัว ชื่อผู้ปกครองที่ติดต่อได้
            เบอร์โทรศัพท์ของผู้ปกครอง ข้อมูลคำถามทางการประเมินภาวะซึมเศร้า
            จะนำไปประมวลผลให้เป็นคะแนนความเสี่ยง
            ในกรณีที่มีความเสี่ยงปานกลางถึงมาก
            ตามโครงการเพื่อความปลอดภัยต่อผู้ที่ได้ประเมิน
            เราจำเป็นต้องส่งข้อมูลให้กับนักจิตวิทยาเพื่อมีการประเมินซ้ำถึงภาวะเสี่ยงต่อโรคซึมเศร้า
            รวมถึง
            เมื่อจำเป็นต้องเข้าการรักษาจะมีการส่งข้อมูลเฉพาะเพื่อการรักษาตามกรณีที่ตรวจพบความผิดปกติ
            เช่น ความเสี่ยงรุนแรงที่จะเป็นโรคซึมเศร้า
            ลักษณะข้อมูลดังกล่าวเพื่อระบุติดตามรายบุคคล
            ตามฐานในการประมวลผลข้อมูลส่วนบุคคลใดในการประมวลผล
            ด้านข้อมูลเพื่อการบริการเกิดประโยชน์ส่วนตนของผู้ประเมิน
          </p>

          <p className="indent-8">
            ท่านสามารถตัดสินใจ ในการรับข้อมูลข่าวสารในการติดตามกลุ่มที่เสี่ยง
            หรือ กลุ่มเป้าหมายต่อนโยบายสุขภาพของทางโรงพยาบาลราชพิพัฒน์ และ
            ทางกรุงเทพมหานครต่อไป ได้ผ่านการเลือกในตอนท้ายของแบบสอบถาม
          </p>

          <p className="indent-8">
            ข้อมูลของท่านจะถูกนำไปวิเคราะห์สำหรับบริหารจัดการนโยบายด้านสุขภาพทางด้านจิต
            เช่น เขตที่อยู่ และค่าคะแนนในการประเมิน ช่วงวัยต่างๆ
            ตามฐานในการประมวลผลข้อมูลส่วนบุคคลใดในการประมวลผล
            ด้านข้อมูลเพื่อการจัดการประโยชน์ต่อสาธารณะ
            ข้อมูลทั้งหมดจะถูกจัดเก็บไว้ที่ ฐานข้อมูลของโรงพยาบาลราชพิพัฒน์
            ภายใต้การควบคุมดูแลของผู้อำนวยการโรงพยาบาล และ
            ผู้จัดการข้อมูลโดยหัวหน้าฝ่ายวิชาการและแผนงาน
          </p>

          <p>
            <span className="font-semibold">2.การเก็บรักษาข้อมูล </span>{" "}
            ข้อมูลส่วนบุคคลของท่านจะเก็บไว้ในระบบที่ปลอดภัย
            และมีมาตรการป้องกันการเข้าถึงโดยไม่ได้รับอนุญาต
            โดยระยะเวลาการเก็บรักษาข้อมูลส่วนบุคคลของท่านตามระยะเวลาของโครงการที่เกิดขึ้น
            และตามมาตรฐานการบันทึกเวชระเบียน
            และจะทำลายข้อมูลเมื่อหมดอายุการใช้งาน
          </p>

          <p>
            <span className="font-semibold">3.การแบ่งปันข้อมูล </span>{" "}
            ทางโรงพยาบาลราชพิพัฒน์
            จำเป็นต้องเปิดเผยข้อมูลบางส่วนให้แก่สำนักงานหลักประกันสุขภาพแห่งชาติ
            เพื่อการเบิกค่าใช้จ่ายตามเกณฑ์ที่กองทุนกำหนด ซึ่งประกอบด้วยข้อมูล
            ชื่อ นามสกุล เลขบัตรประจำตัวประชาชน ผลการคัดกรอง
            และจำเป็นเปิดเผยข้อมูลต่อบุคลากรนักจิตบำบัด หรือ
            นักจิตวิทยาสำหรับกรณีที่การคัดกรองพบความเสี่ยงตามเกณฑ์ของโครงการ
            รวมถึงส่งข้อมูลให้กับสถานพยาบาลที่รับดูแลท่านต่อเพื่อประโยชน์ในการดูแลแบบต่อเนื่อง
            ทางเราอาจเปิดเผยข้อมูลส่วนบุคคลของท่านในกรณีที่หน่วยงานที่ได้รับมอบหมายภายใต้ข้อตกลงการห้ามเปิดเผยข้อมูล
            (NDA) เพื่อการวิเคราะห์ วางแผนเชิงนโยบาย และ การดูแลสุขภาพ ทั้งนี้
            เราจะไม่เปิดเผยข้อมูลส่วนบุคคลของท่านแก่บุคคลภายนอก
            โดยไม่ได้รับความยินยอมจากท่าน
          </p>

          <p>
            <span className="font-semibold">4.สิทธิของท่าน </span> สิทธิของท่าน
            ท่านมีสิทธิดังต่อไปนี้ สิทธิในการเข้าถึงข้อมูลส่วนบุคคลของท่าน
            สิทธิในการแก้ไขข้อมูลให้ถูกต้อง สิทธิในการขอให้ลบหรือ
            ระงับการใช้ข้อมูลของท่าน สิทธิในการถอนความยินยอมการใช้ข้อมูล
            ท่านสามารถใช้สิทธิเหล่านี้ได้โดยติดต่อเราตามข้อมูลด้านล่าง
          </p>

          <p>
            <span className="font-semibold">
              5.การติดต่อหากท่านมีข้อสงสัยเกี่ยวกับการเก็บรวบรวม{" "}
            </span>{" "}
            ใช้หรือเปิดเผยข้อมูลส่วนบุคคล สามารถติดต่อเราได้ที่
            โรงพยาบาลราชพิพัฒน์ ที่อยู่ 18 ถนน พุทธมณฑลสาย 3 แขวงบางไผ่ เขตบางแค
            กรุงเทพมหานคร 10170 โทรศัพท์ E-mail
          </p>
        </div>
=======
        <span className="font-semibold">ประกาศความเป็นส่วนตัวสำหรับแอปประเมินสุขภาพจิต</span>
          <p className="indent-8">
            <span className="font-semibold">ข้อมูลส่วนตัว</span> วัตถุประสงค์ของการประมวลผลข้อมูลส่วนบุคคล เพื่อการนำข้อมูลส่วนบุคคลไปใช้หรือเปิดเผยโรงพยาบาลราชพิพัฒน์ สำนักการแพทย์ กรุงเทพมหานคร ในฐานะเป็นโรงพยาบาลรับส่งต่อ
            และ จัดการระบบสุขภาพในพื้นที่กรุงเทพมหานครที่ 1 (Health zone1) ประกอบด้วย พื้นที่เขต บางแค ภาษีเจริญ หนองแขม ทวีวัฒนา ตลิ่งชันซึ่งพบว่าเกิดปัญหาทางด้านความเครียดในเขตพื้นที่รับผิดชอบ จึงได้ทำเครื่องมือเพื่อให้มีการคัดกรองความเครียดให้กับประชาชนในพื้นที่ได้ใช้บริการ
            รวมถึงจัดหาระบบการส่งต่อที่เหมาะสมให้แก่ผู้เชี่ยวชาญทางด้านให้คำปรึกษาทางจิตในกรณีที่ตรวจคัดกรองพบความเสี่ยงที่จะเกิดโรคซึมเศร้าลักษณะของการเกี่ยวข้อมูลส่วนบุคคลเพื่อให้มีข้อมูลเพียงพอกับการประเมินตามเครื่องมือ
            รวมถึงข้อมูลคำถามประกอบอื่นๆ เพื่อใช้ในการติดตามส่งต่อ ในกรณีที่มีความเสี่ยงต่อภาวะซึมเศร้าในกรณีที่เป็นผู้เยาว์จำเป็นต้องได้รับการดูแลและแจ้งผู้ปกครอง หรือ ผู้แทนอันชอบธรรมในการให้ข้อมูลก่อน </p>

          <p className="indent-8">ในการประกาศเชิญชวนในวงกว้างสำหรับผู้ที่ยังไม่บรรลุนิติภาวะ จำเป็นจะต้องประกาศเชิญชวนผ่านทางผู้แทนของบุคคลนั้นโดยในผู้เยาว์ได้สามารถให้ข้อมูลตามความเห็นของตัวเองได้ถ้าท่านมีความไม่สะดวก
            หรือ สงสัยควรถามให้สิ้นสงสัยก่อนที่จะดำเนินการต่อในกรณีที่ไม่สะดวกในการให้ข้อมูล และไม่สามารถเปิดเผยต่อผู้เชี่ยวชาญทางด้านให้คำปรึกษาทางจิตได้ เมื่อท่านไม่ควรดำเนินการต่อ </p>

          <span className="font-semibold">ประเภทของข้อมูลส่วนบุคคลที่จะถูกประมวลผล </span>

          <p className="indent-8">
            <span className="font-semibold">1.ข้อมูลที่จะถูกบันทึกเพื่อดำเนินการต่อ </span> ได้แก่ ชื่อ นามสกุล เพศ อายุ เลขบัตรประจำตัวประชาชน สถานที่ศึกษา ชั้นที่ศึกษา ช่องทางการติดต่อกลับ ได้แก่ LineID(การเชื่อมต่อทางline) เบอร์โทรศัพท์ส่วนตัว
            ชื่อผู้ปกครองที่ติดต่อได้ เบอร์โทรศัพท์ของผู้ปกครอง ข้อมูลคำถามทางการประเมินภาวะซึมเศร้า จะนำไปประมวลผลให้เป็นคะแนนความเสี่ยงในกรณีที่มีความเสี่ยง ปานกลาง ถึง มาก ตามโครงการเพื่อความปลอดภัยต่อผู้ที่ได้ประเมิน เราจำเป็นต้องส่งข้อมูลให้กับนักจิตวิทยา
            เพื่อมีการประเมินซ้ำถึงภาวะเสี่ยงต่อโรคซึมเศร้า รวมถึง เมื่อจำเป็นต้องเข้าการรักษาจะมีการส่งข้อมูลเฉพาะเพื่อการรักษาตามกรณีที่ตรวจพบความผิดปกติ เช่น ความเสี่ยงรุนแรงที่จะเป็นโรคซึมเศร้า  ลักษณะข้อมูลดังกล่าวเพื่อระบุติดตามรายบุคคล ตามฐานในการประมวลผลข้อมูลส่วนบุคคลใดในการประมวลผล
            ด้านข้อมูลเพื่อการบริการเกิดประโยชน์ส่วนตนของผู้ประเมิน สำหรับข้อมูลตำแหน่งของมือถือในทุกครั้งของการตอบเพื่อให้บริการส่งทีมเคลื่อนที่เร็วไปติดตามโดยเฉพาะกรณีที่คัดกรองและมีความเสี่ยงสูงที่จะฆ่าตัวตาย ซึ่งผู้ที่ทำการตอบแบบสอบถามจะสามารถเลือกที่จะส่งให้ หรือ
            ไม่ส่งก็ได้  ลักษณะข้อมูลดังกล่าวเพื่อระบุติดตามรายบุคคล ตามฐานในการประมวลผลข้อมูลส่วนบุคคลใดในการประมวลผล ด้านข้อมูลเพื่อการบริการเกิดประโยชน์ส่วนตนของผู้ประเมิน</p>

          <p className="indent-8">ท่านสามารถตัดสินใจ ในการรับข้อมูลข่าวสารในการติดตามกลุ่มที่เสี่ยง หรือ กลุ่มเป้าหมายต่อนโยบายสุขภาพของทางโรงพยาบาลราชพิพัฒน์ และ ทางกรุงเทพมหานครต่อไป
            ได้ผ่านการเลือกในตอนท้ายของแบบสอบถาม </p>

          <p className="indent-8">ข้อมูลของท่านจะถูกนำไปวิเคราะห์สำหรับบริหารจัดการนโยบายด้านสุขภาพทางด้านจิต เช่น เขตที่อยู่ และค่าคะแนนในการประเมิน ช่วงวัยต่างๆ ตามฐานในการประมวลผลข้อมูลส่วนบุคคลใดในการประมวลผล ด้านข้อมูลเพื่อการจัดการประโยชน์ต่อสาธารณะ
            ข้อมูลทั้งหมดจะถูกจัดเก็บไว้ที่ ฐานข้อมูลของโรงพยาบาลราชพิพัฒน์ ภายใต้การควบคุมดูแลของผู้อำนวยการโรงพยาบาล และ ผู้จัดการข้อมูลโดยหัวหน้าฝ่ายวิชาการและแผนงาน</p>

          <p className="indent-8">
            <span className="font-semibold">2.การเก็บรักษาข้อมูล </span> ข้อมูลส่วนบุคคลของท่าน จะเก็บไว้ในระบบที่ปลอดภัย และมีมาตรการป้องกันการเข้าถึงโดยไม่ได้รับอนุญาต
            โดยระยะเวลาการเก็บรักษาข้อมูลส่วนบุคคลของท่านตามระยะเวลาของโครงการที่เกิดขึ้น และตามมาตรฐานการบันทึกเวชระเบียน และจะทำลายข้อมูลเมื่อหมดอายุการใช้งาน</p>

          <p className="indent-8">
            <span className="font-semibold">3.การแบ่งปันข้อมูล </span> ทางโรงพยาบาลราชพิพัฒน์ จำเป็นต้องเปิดเผยข้อมูลบางส่วนให้แก่สำนักงานหลักประกันสุขภาพแห่งชาติ เพื่อการเบิกค่าใช้จ่ายตามเกณฑ์ที่กองทุนกำหนด ซึ่งประกอบด้วยข้อมูล ชื่อ นามสกุล เลขบัตรประจำตัวประชาชน ผลการคัดกรอง
            และจำเป็นเปิดเผยข้อมูลต่อบุคลากรนักจิตบำบัด หรือ นักจิตวิทยาสำหรับกรณีที่การคัดกรองพบความเสี่ยงตามเกณฑ์ของโครงการ รวมถึงส่งข้อมูลให้กับสถานพยาบาลที่รับดูแลท่านต่อเพื่อประโยชน์ในการดูแลแบบต่อเนื่อง
            ทางเราอาจเปิดเผยข้อมูลส่วนบุคคลของท่านในกรณีที่หน่วยงานที่ได้รับมอบหมายภายใต้ข้อตกลงการห้ามเปิดเผยข้อมูล (NDA)
            เพื่อการวิเคราะห์ วางแผนเชิงนโยบาย และ การดูแลสุขภาพ ทั้งนี้ เราจะไม่เปิดเผยข้อมูลส่วนบุคคลของท่านแก่บุคคลภายนอก โดยไม่ได้รับความยินยอมจากท่าน ทั้งนี้
            เราจะไม่เปิดเผยข้อมูลส่วนบุคคลของท่านแก่บุคคลภายนอก โดยไม่ได้รับความยินยอมจากท่าน</p>

          <p className="indent-8">
            <span className="font-semibold">4.สิทธิของท่าน </span>ท่านมีสิทธิดังต่อไปนี้ สิทธิในการเข้าถึงข้อมูลส่วนบุคคลของท่าน สิทธิในการแก้ไขข้อมูลให้ถูกต้อง สิทธิในการขอให้ลบหรือ ระงับการใช้ข้อมูลของท่าน
            สิทธิในการถอนความยินยอมการใช้ข้อมูล ท่านสามารถใช้สิทธิเหล่านี้ได้โดยติดต่อเราตามข้อมูลด้านล่าง </p>

          <p className="indent-8">
            <span className="font-semibold">5.การติดต่อหากท่านมีข้อสงสัยเกี่ยวกับการเก็บรวบรวม </span> ใช้ หรือเปิดเผยข้อมูลส่วนบุคคล สามารถติดต่อเราได้ที่ โรงพยาบาลราชพิพัฒน์ ที่อยู่ 18 ถนน พุทธมณฑลสาย 3 แขวงบางไผ่ เขตบางแค กรุงเทพมหานคร 10170 โทรศัพท์    email
            ผู้ที่ควบคุมข้อมูล แพทย์หญิงวรรณิกา แสงสุริย์  ปฏิบัติเป็นรองผู้อำนวยการฝ่ายการแพทย์ และ ผู้ที่ปกป้องข้อมูล เป็น นายแพทย์โกสินธ์ นิ่มปุญญกำพงษ์ หัวหน้าฝ่ายวิชาการ และแผนงาน </p>
>>>>>>> bf0e7c0 (Update)
      </div>
    </div>
  );
};
