import { title } from "@/components/primitives";

export const Step2 = () => {
  return (
    <div className="text-start flex gap-5 flex-col text-sm">
      <div>
        <p className={title({ size: "xs" })}>นโยบายความเป็นส่วนตัว</p>
        <p>ปรับปรุงล่าสุด เดือน มีนาคม 2566</p>
      </div>
      <div className="flex flex-col gap-3">
        <p className="indent-8">
          นโยบายความเป็นส่วนตัวนี้ปรับเปลี่ยนเนื้อหา
          เพื่อให้สอดคล้องและเป็นไปตาม พรบ.คุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2565
          นโยบายความเป็นส่วนตัวนี้มีผลกับแอปพลิเคชันอูก้าและอื่น ๆ
          ที่เกี่ยวข้องทั้งหมด
          ซึ่งให้บริการเชื่อมต่อสื่อสารระหว่างผู้ใช้และแพทย์ หรือ ผู้ให้คำปรึกษา
          นโยบายความเป็นส่วนตัวนี้ได้กำหนดวิธีการที่บริษัทใช้เพื่อเก็บข้อมูล
          จัดการข้อมูล และปกปิดข้อมูลเกี่ยวกับผู้ใช้งานระหว่างใช้แอปพลิเคชัน
        </p>
        <p className="indent-8">
          บริษัทจะเก็บรวบรวมและส่งต่อข้อมูลส่วนตัว
          ข้อมูลทางการแพทย์และสุขภาพเกี่ยวกับผู้ใช้ ระหว่างการใช้แอปพลิเคชัน
          ผู้ใช้ยินยอมให้บริษัทเก็บรวบรวมและส่งต่อข้อมูลส่วนตัวและข้อมูลที่เกี่ยวข้องภายใต้นโยบายความเป็นส่วนตัวนี้
        </p>
        <p className="indent-8">
          ผู้ใช้ที่ไม่ยอมรับนโยบายความเป็นส่วนตัวนี้ ไม่ควรใช้แอปพลิเคชัน
        </p>
      </div>
      <div className="flex flex-col gap-3">
        <span className="font-semibold">
          1. นิยามที่สำคัญ (Important Definition)
        </span>
        <p className="indent-8">
          1.1 ข้อมูลส่วนตัว หมายถึง ข้อมูลส่วนตัวของผู้ใช้งานที่ใช้ระบุตัวบุคคล
          เช่น ชื่อ-นามสกุล รหัสประจำตัวประชาชน ที่อยู่ อีเมล เบอร์โทรศัพท์
          เป็นต้น หรือข้อมูลอื่น ๆ ที่เกี่ยวข้องกับผู้ใช้
        </p>
        <p className="indent-8">
          1.2 ข้อมูลส่วนบุคคลที่มีความละเอียดอ่อน ได้แก่ ข้อมูล เชื้อชาติ,
          เผ่าพันธุ์, ความคิดเห็นทางการเมือง, ความเชื่อในลัทธิ ศาสนาหรือปรัชญา,
          พฤติกรรมทางเพศ, หรือข้อมูลสุขภาพจิตเป็นต้น
        </p>
        <p className="indent-8">
          1.3 ข้อมูลสุขภาพ หมายถึง
          ข้อมูลส่วนตัวผู้ใช้เกี่ยวกับสุขภาพหรือข้อมูลทางการแพทย์
        </p>
        <p className="indent-8">
          1.4 ข้อมูลไม่ระบุตัวผู้ใช้ หมายถึง
          ข้อมูลเกี่ยวกับผู้ใช้ที่ไม่สามารถใช้ระบุตัวผู้ใช้ได้
        </p>
        <p className="indent-8">
          1.5 คุกกี้ คือข้อมูลที่ได้ส่งจาก Site ไปยังเครื่องคอมพิวเตอร์ของผู้ใช้
          ในขณะที่ผู้ใช้เข้าเยี่ยมชมเว็บไซต์นั้นกำลังเข้าเยี่ยมชมเว็บไซต์ของ
          บริษัท
        </p>
        <p className="indent-8">
          1.6 ข้อมูลรายละเอียดการสนทนากับบริษัท หมายถึง
          รายละเอียดการสนทนาระหว่างท่านและผู้ให้คำปรึกษา และบุคคลากรของบริษัท
          รวมถึงแบบประเมินอาการ บทสนทนาระหว่างท่านและบลุคคลากรของเราผ่านอีเมล
          live chat
        </p>
      </div>
      <div className="flex flex-col gap-3">
        <span className="font-semibold">2. การจัดเก็บข้อมูลส่วนบุคคล</span>
        <p className="indent-8">
          เมื่อผู้ใช้สร้างบัญชีอูก้า
          หรือให้ข้อมูลส่วนตัวผู้ใช้ผ่านทางแอปพลิเคชัน
          ข้อมูลที่บริษัทจัดเก็บอาจรวมถึงข้อมูลต่าง ๆ เหล่านี้
        </p>
        <p>
          <span className="font-semibold">ข้อมูลชื่อ </span>{" "}
          หากคุณเพิ่มข้อมูลในการตั้งค่าหรือการลงทะเบียน บริษัทจะเก็บ ชื่อนิรยาม
          ชื่อจริง นามสกุล ชื่อนิรนาม
        </p>
        <p>
          <span className="font-semibold">ข้อมูลคุณลักษณะของบุคคล </span>{" "}
          ในการลงทะเบียน บริษัทจะเก็บข้อมูลคุณลักษณะของคุณเช่น วันเดือนปีเกิด (อายุ) เพศ
          ในบางบริการ เช่น บริการ e-prescription เราจำเป็นต้องเก็บข้อมูลเพิ่มเติม เช่น ส่วนสูง น้ำหนัก
        </p>
        <p>
          <span className="font-semibold">ข้อมูลเกี่ยวกับการติดต่อ </span>{" "}
          ข้อมูลการติดต่อรวมถึง เบอร์โทรศัพท์เคลื่อนที่ อีเมล ในบางบริการ เช่น บริการ e-prescription เราจำเป็นต้องเก็บข้อมูลเพิ่มเติม เช่น ที่อยู่อาศัย
        </p>
        <p>
          <span className="font-semibold">ข้อมูลสุขภาพ </span>{" "}
          ข้อมูลหรือบันทึกที่เกี่ยวข้องกับ ประวัติความเจ็บป่วย การตรวจร่างกาย ผลทางห้องปฏิบัติการ ผลทางรังสีวิทยา และข้อมูลอื่น ๆ ที่เกี่ยวข้องกับสุขภาพ ประวัติความเจ็บป่วย
        </p>
        <p>
          <span className="font-semibold">ข้อมูลสุขภาพเกี่ยวกับผู้ใช้ที่บันทึกโดยแพทย์/ผู้ให้คำปรึกษาผ่านทางแอปพลิเคชัน</span>{" "}
          เวชระเบียน
          ข้อมูลการซักประวัติตรวจรักษา 
          ข้อมูลอื่นที่เกี่ยวข้องกับสุขภาพบักทึกการให้คำปรึกษา(visit note) 
          ข้อมูลวิดีโอและเสียงการสนทนาระหว่างคุณและแพทย์/ผู้ให้คำปรึกษา
        </p>
        <p>
          <span className="font-semibold">ข้อมูลเกี่ยวกับการใช้ข้อมูลออนไลน์ข้อมูลเชิงเทคนิค ข้อมูลที่เก็บผ่านอุปกรณ์ </span>{" "}
          ข้อมูลการเข้าถึงสื่อเสียง / ภาพวิดีทัศน์ / ภาพถ่าย / กล้อง ข้อมูลบันทึกการโทร สมุดบัญชีรายชื่อผู่ติดต่อ / ที่อยู่ ข้อความหรืออีเมล (เนื้อหาอีเมล) หมายเลขประจำตัวเครื่อง (Unique Device Identifier: UDID) ที่อยู่ไอพี (IP Address)
          ข้อมูลเกี่ยวกับพฤติกรรมการใช้งานเว็บไซต์และแอปพลิเคชัน (event tracking) จำนวนครั้งในการเข้าเยี่ยมชมเว็บไซต์หรือมีการกระทำ (event) ในแอปพลิเคชัน โดยข้อมูลเหล่านี้เป็นข้อมูลที่ไม่ได้ระบุตัวตนของคุณ
          คุกกี้ หรือเทคโนโลยีอื่นใดที่มีลักษณะคล้ายคลึงกัน
          ข้อมูลประจำตัวในการล็อกอินรหัสที่ใช้เพื่อความปลอดภัย รหัสการเข้าถึงหรือรหัสผ่าน ชื่อบัญชีผู้ใช้งาน รหัสผ่านเข้าใช้บัญชี รหัสผ่านสำหรับใช้ครั้งเดียว (OTP)
          Token และข้อความ SMS
          ข้อมูล Telemetry ข้อมูลที่ใช้กำกับและอธิบายข้อมูลหลัก (Metadata) หมายเลขเครื่องและประเภทเครื่อง เครือข่าย รายละเอียดการเชื่อมต่อ ประเภท Plug-in ของเบราว์เซอร์รวมทั้งเวอร์ชัน ระบบปฏิบัติการและแพลตฟอร์ม การตั้งค่าเขตเวลาและสถานที่ตั้ง (GPS)
          ข้อมูลเกี่ยวกับวิธีที่คุณใช้ การตอบสนองต่อการโฆษณาผ่านหน้าเว็บไซต์ ที่คุณใช้คลิกลิงค์ (เช่น Referrer URL หรือ Dynamic Link หรือ Deep Link)
          ข้อมูล Crash Report และเทคโนโลยีอื่นบนอุปกรณ์การสื่อสารที่คุณใช้เพื่อเข้าถึงแพลตฟอร์ม
        </p>
        <p>
          <span className="font-semibold">ข้อมูลบัญชี โซเชียล </span>{" "}
          บัญชี Line Facebook บัญชี Apple หรืออีเมลผ่าน Gmail (หากคุณมีการผูกบัญชี บริการผ่านการบัญชี โซเชียลเท่านั้น)
          ข้อมูลหรือบันทึกที่เกี่ยวข้องกับ ประวัติความเจ็บป่วย การตรวจร่างกาย ผลทางห้องปฏิบัติการ ผลทางรังสีวิทยา และข้อมูลอื่น ๆ ที่เกี่ยวข้องกับสุขภาพ ประวัติความเจ็บป่วย
        </p>
        <p>
          <span className="font-semibold">ข้อมูลเกี่ยวกับ พฤติกรรม ความชื่นชอบ มุมมอง ข้อซักถาม และความคิดเห็น </span>{" "}
          ข้อมูลเกี่ยวกับพฤติกรรม ความชื่นชอบ มุมมอง ขอซักถาม และความคิดเห็นจากการใช้บริการของคุณ เช่น การตอบแบบตรวจสอบความพึงพอใจในการใช้งาน
        </p>
        <p>
          <span className="font-semibold">ข้อมูลบันทึกการติดต่อระหว่างคุณและบริษัท </span>{" "}
          รายละเอียดการสนทนาระหว่างคุณกับที่ ปรึกษา บุคลากรของบริษัท รวมถึงการประเมินอาการ การสนทนาระหว่างคุณและบุคลากรของเราทางอีเมลและ live chat
        </p>
        <p>
          <span className="font-semibold">ข้อมูลที่ส่งโดยผู้ใช้ผ่านแอปพลิเคชัน แบบฟอร์มอิเล็กทรอนิกส์ หรือบริการที่ เกี่ยวข้องของบริษัท </span>{" "}
          ข้อมูลที่ท่านได้กรอกลงบนเว็บไซต์หรือเอกสารต่าง ๆ ข้อมูลที่ท่านร่วมกิจกรรมกับเรา ข้อมูลที่ท่านให้เมื่อติดต่อเรา
        </p>
        <p>
          <span className="font-semibold">ข้อมูลเกี่ยวกับบริการ </span>{" "}
          รายละเอียดข้อมูลเกี่ยวกับการนัดหมายใช้บริการ เช่น แพทย์ที่คุณเลือกนัดหมาย เวลานัดหมาย support pin หรือ User ID
          บันทึกการสั่งทำรายการ เช่น เวลาที่ทำการชำระเงิน หรือช่องทางการชำระเงิน
          ข้อมูลอื่นใดที่คุณได้ให้ไว้เป็นส่วนหนึ่งในการบริการหรือการบริหารความสัมพันธ์
        </p>        
        <p className="indent-8">ข้อมูลที่ส่งโดยผู้ใช้ผ่านแอปพลิเคชัน แบบฟอร์มอิเล็กทรอนิกส์ หรือบริการที่ เกี่ยวข้องของบริษัท 
          ข้อมูลที่ท่านได้กรอกลงบนเว็บไซต์หรือเอกสารต่าง ๆ ข้อมูลที่ท่านร่วมกิจกรรมกับเรา ข้อมูลที่ท่านให้เมื่อติดต่อเรา
        </p>

      </div>
      <div className="flex flex-col gap-3">
        <span className="font-semibold">3. การใช้และการเปิดเผยข้อมูลส่วนบุคคล</span>
        <p className="indent-8"></p>
        <p className="indent-8">บริษัทจะใช้ข้อมูลส่วนที่บริษัทได้รับจากผู้ใช้หรือส่งต่อแก่บุคคลภายนอก (รวมถึงบริษัทที่เกี่ยวข้อง ผู้ให้บริการภายนอก ผู้ขายที่เป็นบุคคลภายนอก) เพื่อประโยชน์ของกิจการทั้งหมดหรือแต่บางส่วนดังจะได้กล่าวต่อไปนี้</p>
        
        <p className="indent-8">
          3.1 การเปิดเผยข้อมูลที่จำเป็นต่อการให้บริการ ได้แก่</p>
          
          <p>
          <p className="indent-8">
          <span className="font-semibold">o วัตถุประสงค์เพื่อดำเนินการหรือสนับสนุนการใช้แอปพลิเคชัน </span>{" "}
          รายละเอียด
          การให้บริการลูกค้าในจัดการบัญชีการใช้งานของผู้ใช้ตามสิทธิ์ที่ผู้ใช้มีกับบริษัท (ถ้ามี)
          การออกหรือส่งมอบเอกสารที่เกี่ยวข้อง
          ให้การสนับสนุนโดยติดต่อผู้ใช้ในกรณีเกิดปัญหาในการใช้งานแอปพลิเคชันหรือบริการ หรือต้องการสอบถามข้อมูลเพิ่มเติม
        </p>
        </p>

        <p>
        <p className="indent-8">
          <span className="font-semibold">o เพื่อให้บริการเชิงสุขภาพกับคุณรวมถึงการให้คำปรึกษาทางการแพทย์ </span>{" "}
          การวินิจฉัย และการรักษา หากคุณใช้บริการเชิงสุขภาพกับเรา
          การให้คำปรึกษาผ่านเสียง วิดีโอคอล กับผู้ให้คำปรึกษาจากแพทย์หรือบุคคลากรทางการแพทย์
        </p>
        </p>
        
        <p>
          <p className="indent-8">
          <span className="font-semibold">o การธุรกรรมทางการเงิน </span>{" "}
          การเปิดเผยข้อมูลแก่ผู้ประกอบการและบริษัทบัตรเครดิตเพื่อให้อนุมัติและหักบัญชี การดำเนินการเพื่อหักบัญชีอัตโนมัติ
          เพื่อตรวจสอบและจัดการการธุรกรรมทางการเงินที่เกิดขึ้นภายในระบบบริษัท
          การจัดเก็บประวัติการชำระเงินภายในเครื่องมือภายในของบริษัทตลอดจนในแอปพลิเคชันของผู้ใช้
        </p>
        </p>
        
        <p>
          <p className="indent-8">
          <span className="font-semibold">o ยืนยันตัวตน </span>{" "}
          การยืนยันตัวตนของคุณผ่าน ข้อมูลส่วนบุคคล เพื่อให้คุณสามารถใช้สิทธิ์ในการจัดการบริหารข้อมูลของคุณที่มีอยู่ในบริษัทตาม สิทธิ์ของท่านเกี่ยวกับข้อมูลส่วนบุคคล
        </p>
        </p>

        <p>
          <p className="indent-8">
          <span className="font-semibold">o เก็บรักษาข้อมูล </span>{" "}
          การกรอกข้อมูลของคุณ เก็บรวบรวม บันทึก การบริหารจัดการฐานข้อมูลของลูกค้า
        </p>
        </p>
        <p className="indent-8">
        3.2 การเปิดเผยข้อมูลในกรณีพิเศษ หรือถูกปกป้องโดยกฎหมาย ได้แก่</p>
        <p>
          <p className="indent-8">
          <span className="font-semibold">o วัตถุประสงค์เพื่อป้องกันเหตุอันตรายต่อชีวิตหรือร่างกาย</span>{" "}
          รายละเอียด
          เพื่อช่วยเหลือผู้ใช้ในกรณีฉุกเฉิน
          ป้องกันเหตุอันตรายต่อชีวิต สุขภาพ หรือร่างกาย
        </p></p>
        <p>
          <p className="indent-8">
          <span className="font-semibold">o เพื่อประโยชน์โดยชอบด้วยกฎหมาย</span>{" "}
          ในกรณีสำหรับวัตถุประสงค์ในการบังคับใช้กฎหมาย หรือการปฏิบัติตามกฎหมาย ระเบียบ ข้อบังคับหรือการร้องขออื่นใด
        </p></p>

        <p className="indent-8">
        3.3 การเปิดเผยข้อมูลในการประมวลผลและปรับปรุงคุณภาพบริการ </p>
        <p>
          <p className="indent-8">
          <span className="font-semibold">o เพื่อการวิเคราะห์ ประเมินผล</span>{" "}
          การวิเคราะห์การใช้บริการผ่านแอปพลิเคชันบนโทรศัพท์มือถือและเว็บไซต์ ที่คุณเข้าเยี่ยมชม
          การตรวจสอบการประเมินจุดเชื่อมต่อ (การบูรณาการ) และประสบการณ์ผู้ใช้ การทดสอบคุณลักษณะเพื่อทำความเข้าใจพฤติกรรมของลูกค้า
          การระบุและแก้ไขปัญหาแอปพลิเคชันในเชิงระบบ เช่น ความเสถียรของการใช้งาน
        </p></p>
        <p>
          <p className="indent-8">
          <span className="font-semibold">o การปรับปรุงคุณภาพผลิตภัณฑ์และบริการ </span>{" "}
          ข้อมูลจากการวิเคราะห์ การพัฒนาอินเทอร์เฟซและการทำแผนที่ข้อมูล เค้าโครงและเนื้อหาของหน้าแอปพลิเคชันและเว็บไซต์ (อินเทอร์เฟซผู้ใช้)
          ทดสอบบริการใหม่ของบริษัทผ่านกลุ่มรุ่นเล็ก (เบต้า) หรือทยอยเปิดตัว
          วิเคราะห์ข้อมูลเพื่อปรับปรุงประสิทธิภาพการตลาดและการโฆษณา
          การตรวจสอบคำร้องเรียนหรือการใช้การควบคุมคุณภาพผู้ให้บริการ (เมื่อได้รับการยินยอม)
        </p></p>
        <p>
          <p className="indent-8">
          <span className="font-semibold">o การโฆษณา การทำการตลาด </span>{" "}
          การแจ้งข่าวสารการประกาศ และการแจ้งข้อมูลอื่นใดเกี่ยวกับการบริการ 
          แจ้งเกี่ยวกับสิทธิ์พิเศษ แคมแปญการตลาด 
          การสำรวจวิเคราะห์และวิจัยดกานการตลาด การวิเคราะห์พฤติกรรมลูกค้าและการแบ่งกลุ่มลูกค้า (Segmentation)
        </p></p>
        <p>
          <p className="indent-8">
          <span className="font-semibold">o วัดผลและบริหารประสิทธิภาพในการทำโฆษณาและการตลาด </span>{" "}
          เพื่อเสนอบริการที่ดีและเหมาะสมแก่ท่าน
          ประมวลผลเพื่อทำความเข้าใจกลุ่มลูกค้า และนำเสนอ ข้อมูล สิทธิพิเศษที่บริษัทคาดว่ามีประโยช์นต่อท่าน 
        </p></p>
        <p>
          <p className="indent-8">
          <span className="font-semibold">o การจัดทำรายงานเกี่ยวกับการให้บริการ </span>{" "}
          การจัดทำและเผยแพร่รายงาน (ทั้งภายในองค์กรและภายนอกองค์กร) เกี่ยวกับสถิติการใช้บริการ (เช่น ผลการติดต่อกับลูกค้า) 
          การจัดทำรายงานการวิเคราะห์ต่างๆ ตามข้อกำหนดของหน่วยงานที่มีอำนาจ รายงานการวิเคราะห์ต่างๆ อื่น เพื่อวัตถุประสงค์ทางธุรกิจของบริษัท (ซึ่งหากมีข้อมูลส่วนบุคคล ทางบริษัทจะขอการยินยอมจากคุณก่อนเสมอ) 
        </p></p>

        <p className="indent-8">
        3.3 การเปิดเผยข้อมูลในการประมวลผลและปรับปรุงคุณภาพบริการ </p>
        <p>
          <p className="indent-8">
          <span className="font-semibold">o เพื่อการวิเคราะห์ ประเมินผล </span>{" "}
          การวิเคราะห์การใช้บริการผ่านแอปพลิเคชันบนโทรศัพท์มือถือและเว็บไซต์ ที่คุณเข้าเยี่ยมชม
          การตรวจสอบการประเมินจุดเชื่อมต่อ (การบูรณาการ) และประสบการณ์ผู้ใช้ การทดสอบคุณลักษณะเพื่อทำความเข้าใจพฤติกรรมของลูกค้า
          การระบุและแก้ไขปัญหาแอปพลิเคชันในเชิงระบบ เช่น ความเสถียรของการใช้งาน
        </p></p>
        <p>
          <p className="indent-8">
          <span className="font-semibold">o การปรับปรุงคุณภาพผลิตภัณฑ์และบริการ </span>{" "}
          ข้อมูลจากการวิเคราะห์ การพัฒนาอินเทอร์เฟซและการทำแผนที่ข้อมูล เค้าโครงและเนื้อหาของหน้าแอปพลิเคชันและเว็บไซต์ (อินเทอร์เฟซผู้ใช้)
          ทดสอบบริการใหม่ของบริษัทผ่านกลุ่มรุ่นเล็ก (เบต้า) หรือทยอยเปิดตัว
          วิเคราะห์ข้อมูลเพื่อปรับปรุงประสิทธิภาพการตลาดและการโฆษณา
          การตรวจสอบคำร้องเรียนหรือการใช้การควบคุมคุณภาพผู้ให้บริการ (เมื่อได้รับการยินยอม)
        </p></p>
        <p>
          <p className="indent-8">
          <span className="font-semibold">o การโฆษณา การทำการตลาด </span>{" "}
          การแจ้งข่าวสารการประกาศ และการแจ้งข้อมูลอื่นใดเกี่ยวกับการบริการ 
          แจ้งเกี่ยวกับสิทธิ์พิเศษ แคมแปญการตลาด 
          การสำรวจวิเคราะห์และวิจัยดกานการตลาด การวิเคราะห์พฤติกรรมลูกค้าและการแบ่งกลุ่มลูกค้า (Segmentation)
        </p></p>
        <p>
          <p className="indent-8">
          <span className="font-semibold">o วัดผลและบริหารประสิทธิภาพในการทำโฆษณาและการตลาด </span>{" "}
          เพื่อเสนอบริการที่ดีและเหมาะสมแก่ท่าน
          ประมวลผลเพื่อทำความเข้าใจกลุ่มลูกค้า และนำเสนอ ข้อมูล สิทธิพิเศษที่บริษัทคาดว่ามีประโยช์นต่อท่าน 
        </p></p>
        <p>
          <p className="indent-8">
          <span className="font-semibold">o การจัดทำรายงานเกี่ยวกับการให้บริการ </span>{" "}
          <p className="text-justify">
          การจัดทำและเผยแพร่รายงาน(ทั้งภายในองค์กรและภายนอกองค์กร) เกี่ยวกับสถิติการใช้บริการ(เช่น ผลการติดต่อกับลูกค้า)การจัดทำรายงานการวิเคราะห์ต่างๆตามข้อกำหนดของหน่วยงานที่มีอำนาจรายงานการวิเคราะห์ต่างๆเพื่อวัตถุประสงค์ทางธุรกิจของบริษัท(ซึ่งหากมีข้อมูลส่วนบุคคล ทางบริษัทจะขอการยินยอมจากคุณก่อนเสมอ) 
          </p></p></p>

        <p className="indent-8">
        3.4 การเปิดเผยข้อมูลในการประมวลผลและปรับปรุงคุณภาพบริการ 
        </p>
        
        <p>
          <p className="indent-8">
          <span className="font-semibold">o โครงการวิจัย </span>{" "}
          <p className="text-justify">
          บริษัทจะเปิดเผยข้อมูลของผู้ใช้ภายใต้โครงการกำแพงพักใจให้แก่อาสาสมัครภายใต้โครงการกำแพงพักใจเท่านั้นข้อมูลถูกเปิดเผยเพื่อวัตถุประสงค์ดังต่อไปนี้เพื่อติดต่อผู้ใช้งานภายได้โครงการกำแพงพักใจ เพื่อขอความยินยอมในการเข้าร่วมในโครงการวิจัยของบุคคลที่สามเพื่อแจ้งผู้ใช้โครงการกำแพงพักใจเกี่ยวกับกิจกรรมใดๆ ที่ดำเนินการโดยอาสาสมัครโครงการกำแพงพักใจเพื่อดำเนินการแคมเปญโครงการ
          ข้อมูลจะรวมถึง
          </p>
          <p className="indent-8">ชื่อ (ชื่อ นามสกุล นามแฝง)</p>
          <p className="indent-8">สถาบันการศึกษา </p>
          <p className="indent-8">ข้อมูลติดต่อ (ที่อยู่อีเมลและหมายเลขโทรศัพท์)</p> 
          </p>
        </p>
          
          <p className="indent-8">อาสาสมัครโครงการกำแพงพักใจ ต้องระบุวัตถุประสงค์ในการติดต่อและขอความยินยอมจากผู้ใช้โดยตรงก่อนที่จะทำการเปิดเผยข้อมูลส่วนบุคคลอื่น ๆ </p>
          
         
        <p className="indent-8">
        เมื่อผู้ใช้ได้สมัครเพื่อเปิดบัญชีการใช้บริการกับอูก้าหรือได้ส่งมอบข้อมูลส่วนตัวของผู้ใช้ผ่านทางแอปพลิเคชัน บริษัทใช้ข้อมูลส่วนตัวของผู้ใช้เพื่อส่งข่าวสารทางการตลาดและโปรโมชั่นต่าง ๆ เกี่ยวกับบริการของบริษัทหรือของแพทย์/ผู้ให้คำปรึกษาที่เป็นบุคคลภายนอกเป็นครั้งคราว ผู้ใช้สามารถยกเลิกการรับข้อมูลการตลาดได้ตลอดเวลา โดยการใช้ระบบการยกเลิกการรับข้อมูลที่อยู่ในข้อมูลทางการตลาดที่จัดส่งให้ (unsubscribe) บริษัทอาจใช้ข้อมูลการติดต่อของผู้ใช้เพื่อส่งเอกสารข่าวสารจากบริษัทหรือจากบริษัทที่เกี่ยวข้องของบริษัท
        ในกรณีที่เป็นข้อยกเว้นและบริษัทถูกขอให้เปิดเผยข้อมูลส่วนตัว อาจส่งมอบข้อมูลส่วนตัวของผู้ใช้ให้แก่บุคคลภายนอกหรือบริษัทในเครือของบริษัทสำหรับวัตถุประสงค์ดังกล่าวมาข้างต้
        </p>
        
      </div>
      <div className="flex flex-col gap-3">
        <span className="font-semibold">4. การใช้และการเปิดเผยข้อมูลส่วนบุคคล</span>
        <p className="indent-8"></p>
        <p className="indent-8">บริษัทจะใช้ข้อมูลส่วนที่บริษัทได้รับจากผู้ใช้หรือส่งต่อแก่บุคคลภายนอก (รวมถึงบริษัทที่เกี่ยวข้อง ผู้ให้บริการภายนอก ผู้ขายที่เป็นบุคคลภายนอก) เพื่อประโยชน์ของกิจการทั้งหมดหรือแต่บางส่วนดังจะได้กล่าวต่อไปนี้</p>
        
      </div>

      {/*<div className="flex flex-col gap-3">
                <span className="font-semibold">4. การยินยอมเข้ารับบริการ (Inform Consent)</span>
                <p><span className="font-semibold">ก. </span> การแพทย์ทางไกล (Telehealth) คือการให้บริการทางสุขภาพโดยใช้เทคโนโลยีโต้ตอบทางภาพเคลื่อนไหวและเสียงโดยผู้ป่วย และบุคลากรทางการแพทย์นั้นไม่ได้อยู่ในสถานที่ทางกายภาพเดียวกัน ระหว่างการให้คำปรึกษาสุขภาพทางไกล ท่านอาจต้องให้ข้อมูลสนทนาเกี่ยวกับรายละเอียดของประวัติทาง สุขภาพและประวัติส่วนตัวของท่าน ผ่านการโต้ตอบผ่านภาพเคลื่อนไหวและเสียง หรือเทคโนโลยีทางการสื่อสารทางไกลอื่นๆ และ แพทย์หรือผู้ให้คำปรึกษานั้น อาจซักประวัติหรือสังเกตหรือขอให้ท่านตรวจร่างกายตนเอง เพื่อประกอบการวินิจฉัยและให้คำแนะนำผ่านเทคโนโลยีดังกล่าว</p>
                <p><span className="font-semibold">ข. </span> การรับคำแนะนำทางสุขภาพทางไกลจากผู้ให้คำปรึกษาจากกลุ่ม แพทย์หรือผู้ให้คำปรึกษานั้น ไม่สามารถแทนที่การพบแพทย์ที่สถานพยาบาล หรือแทนที่การรักษาอย่างต่อเนื่องกับแพทย์ที่รักษาประจำได้</p>
                <p className="indent-8">ท่านอาจเข้ารับการให้คำแนะนำต่อเนื่องกับแพทย์หรือผู้ให้คำปรึกษาบางท่านผ่านแอปพลิเคชัน ซึ่งในการเข้าพบครั้งแรกกับผู้ให้คำปรึกษาเป็นเพียงการเริ่มการรับคำปรึกษา (เพื่อพิจารณา แนวทางในการรักษาที่เหมาะสมที่สุดในการดูแลสำหรับท่าน) และไม่จำเป็นจะต้องพบแพทย์ต่อเนื่องผ่านแอปพลิเคชันเสมอไป แพทย์หรือผู้ให้คำปรึกษาผ่านแอปพลิเคชันอาจแนะนำให้ผู้รับคำแนะนำ มองหาความช่วยเหลือทางการแพทย์ฉุกเฉิน การตรวจติดตามการรักษาจากแพทย์ที่สถานพยาบาล หรือไปตรวจรักษากับแพทย์ที่สถานพยาบาล ซึ่งผู้รับคำแนะนำควรปฏิบัติตามคำแนะนำดังกล่าวเพื่อความปลอดภัยของผู้รับคำแนะนำ</p>
                <p className="indent-8">โรงพยาบาลราชพิพัฒน์อาจทำการนัดหมายสำหรับการตรวจติดตาม ผ่านแอปพลิเคชัน หรือช่องทางอื่นที่ท่านได้ระบุไว้ ท่านอาจจะได้รับการติดต่อจากฝ่ายสนับสนุนบริการลูกค้า (Customer Support Service) เพื่อติดตามผลหลังจากการได้รับการรักษา ผลข้างเคียง หรือผลแทรกซ้อนอื่นๆ ซึ่งประโยชน์ของการใช้แอปพลิเคชัน คือการเพิ่มความสามารถในการเข้าถึงกลุ่มวิชาชีพทางการแพทย์และอำนวยความสะดวกสบายให้แก่ท่าน แต่อย่างไรก็ตาม การให้บริการทางการแพทย์ทางไกลนั้น มีความเสี่ยงเช่นเดียวกันกับการให้การบริการทางสุขภาพอื่นๆ และความเสี่ยงที่อาจเกิดขึ้น อาจเป็นข้อจำกัดทางเทคนิค อันได้แก่</p>
                <p className="indent-8"><span className="font-semibold">•</span> ข้อมูลที่ส่งต่อนั้นไม่เพียงพอ (เช่น ความคมชัดของภาพไม่เพียงพอ) ที่จะสามารถช่วยให้ท่านตัดสินใจในการรับการรักษาได้ </p>
                <p className="indent-8"><span className="font-semibold">•</span> ความล่าช้าของสัญญาณ หรือการขาดช่วงของสัญญาณ ที่ทำให้สัญญาณหลุดหรือสื่อสารไม่ได้ ซึ่งสามารถเกิดได้จากความผิดปกติของเครื่องมืออิเล็กทรอนิกส์ ถ้าเหตุการณ์เหล่านี้เกิดขึ้น ท่านอาจได้รับการติดต่อผ่านโทรศัพท์หรืออีเมล จากทีม Customer Support Service เพื่อช่วยเหลือ หรือ การสื่อสารผ่านช่องทางอื่นๆ ในทางกลับกันท่านสามารถแจ้งเรื่อง เพื่อขอความช่วยเหลือได้ผ่าน Customer Support Service ผ่านทางอีเมล support@ooca.co ระบบแชท หรือโทรศัพท์ ได้เช่นเดียวกัน</p>
                <p className="indent-8"><span className="font-semibold">•</span> ข้อจำกัดในการรับทราบประวัติทางการแพทย์ของท่าน อาจจะส่งผลให้การแนะนำที่ปราศจากประวัติข้อมูลทางการแพทย์ของท่านผิดพลาด และอาจส่งผลให้ท่านเกิดอาการแพ้ยา หรือมีผลแทรกซ้อน หรือเกิดความผิดพลาดอื่นๆ ได้ </p>
                <p className="indent-8"><span className="font-semibold">•</span> ถึงแม้ว่าโรงพยาบาลราชพิพัฒน์จะมีมาตรการป้องกันความเป็นส่วนตัวและความ ปลอดภัยของข้อมูลผู้ป่วย แต่ในบางกรณี มาตรการนั้นอาจล้มเหลว ทำให้เกิดการรั่วไหลของข้อมูลได้ </p>
                <p><span className="font-semibold">ค. </span> การยอมรับข้อตกลงและเงื่อนไขดังกล่าว ท่านรับทราบและเข้าใจและยอมรับว่า: ท่านเข้าใจว่าท่านสามารถคาดหวังประโยชน์จากการใช้แอปพลิเคชัน แต่ไม่มีการรับรองผลใดๆ ท่านเข้าใจว่า กฎหมายและข้อบังคับที่คุ้มครองความเป็นส่วนตัวและความปลอดภัยของข้อมูลทางสุขภาพนั้น สามารถใช้กับการให้บริการทางแพทย์ทางไกลได้ และได้รับจดหมายเตือนเกี่ยวกับความเป็นส่วนตัวจากทางโรงพยาบาลราชพิพัฒน์แล้ว ข้อมูลการสื่อสารอิเล็กทรอนิกส์และประวัติการรักษาจะผ่านการเข้ารหัสความปลอดภัยเสมอ ถ้าประกันสุขภาพของท่านไม่สามารถครอบคลุมค่าใช้จ่ายที่เกิดขึ้นผ่านการให้บริการ ท่านต้องรับผิดชอบต่อค่าใช้จ่ายนั้น แพทย์/ผู้ให้คำปรึกษาอาจพิจารณาว่าการให้บริการผ่าน แอปพลิเคชันนั้น ไม่เหมาะสมกับการรักษาภาวะเจ็บป่วยของท่าน และอาจเลือกที่จะไม่ให้บริการแก่ท่านผ่านแอปพลิเคชัน ในการรักษาจิตบำบัด ท่านจะได้รับข้อมูลเกี่ยวกับวิธีการรักษา ระยะเวลาของการรักษา(ถ้าทราบ) และค่าใช้จ่าย ถ้าท่านสามารถขอความเห็นจากจิตแพทย์หรือนักจิตวิทยาท่านอื่นหรือสิ้นสุดการรักษาได้เสมอ</p>
                <p><span className="font-semibold">ง. </span> ท่านสามารถส่งข้อความไปยังแพทย์หรือผู้ให้คำปรึกษาของท่าน ผ่านทางฝ่ายสนับสนุนบริการลูกค้า (Customer Support Service) ซึ่งแพทย์/ผู้ให้คำปรึกษาไม่อาจจะตอบกลับข้อความ ได้ทันที หากท่านมีภาวะฉุกเฉินหรือต้องการความช่วยเหลือฉุกเฉิน กรุณาติดต่อ 1669 หรือสถานพยาบาลที่ใกล้ที่สุด</p>
            </div>
            <div className="flex flex-col gap-3">
                <span className="font-semibold">5. ความเป็นส่วนตัว</span>
                <p className="indent-8">โรงพยาบาลราชพิพัฒน์ให้ความสำคัญกับความปลอดภัยของข้อมูลผู้ใช้ที่ต้อง ปกปิดเป็นความลับ โดยมีแนวทางในการปกปิดข้อมูลตามนโยบายความเป็นส่วนตัว (Privacy Policy) ที่โรงพยาบาลราชพิพัฒน์ในประกาศไว้ โดยโรงพยาบาลราชพิพัฒน์จะใช้ความระมัดระวังเกี่ยวกับมาตรการรักษาความ ปลอดภัยของโรงพยาบาลราชพิพัฒน์ เพื่อให้มีการรักษาความปลอดภัยของ ข้อมูลใดๆ ของผู้ใช้</p>
            </div>
            <div className="flex flex-col gap-3">
                <span className="font-semibold">6. บัญชีผู้ใช้</span>
                <p className="indent-8">ท่านต้องสร้างบัญชีผู้ใช้เพื่อเข้าใช้แอปพลิเคชัน ในการลงทะเบียนท่านจำเป็นต้องกรอก ชื่อ นามสกุล, อีเมล, รหัสผ่าน และข้อมูลอื่นๆ ที่เกี่ยวข้อง (ต่อไปนี้เรียกว่า “ข้อมูลบัญชี”) โดยในการสร้างบัญชีท่านต้องบรรลุนิติภาวะ ผู้ที่ยังไม่บรรลุนิติภาวะไม่อนุญาตให้สร้างบัญชีเองได้ ท่านต้องรับรองว่าข้อมูลผู้ใช้ของท่านเป็นข้อมูลจริง ถูกต้อง และสมบูรณ์ทุกครั้งที่ท่านเข้าใช้แอปพลิเคชัน ท่านจะต้องไม่เปิดเผยหรือแบ่งปันรหัสผ่านของท่านให้กับผู้อื่น และต้องรักษารหัสผ่านของท่าน เพื่อให้มั่นใจได้ว่าจะไม่มีใครสามารถเข้าบัญชีในชื่อของท่านได้ นอกจากท่าน โรงพยาบาลราชพิพัฒน์จะไม่สามารถเข้าบัญชีหรือนำข้อมูลผู้ใช้ของท่านไปใช้ เพื่อประโยชน์การอื่นที่ไม่เกี่ยวข้องกับแอปพลิเคชันได้</p>
            </div>
            <div className="flex flex-col gap-3">
                <span className="font-semibold">7. การให้บริการแก่ผู้ที่ยังไม่บรรลุนิติภาวะ</span>
                <p className="indent-8">ผู้ที่ยังไม่บรรลุนิติภาวะ (อายุน้อยกว่า 15 ปีถ้วน) สามารถใช้แอปพลิเคชันได้ภายใต้การดูแลและการให้คำยินยอมจากผู้ปกครองหรือผู้แทนโดยชอบธรรม โดยผู้ปกครองหรือผู้แทนโดยชอบธรรม ต้องเป็นผู้รับผิดชอบในการสร้างบัญชีผู้ใช้ ยอมรับและให้คำยินยอมตามข้อกำหนดและเงื่อนไข รวมถึงเข้าร่วมการสนทนาพร้อมกันแก่ผู้ยังไม่บรรลุนิติภาวะ</p>
            </div>
            <div className="flex flex-col gap-3">
                <span className="font-semibold">8. สิทธิ์การเข้าใช้</span>
                <p className="indent-8">โรงพยาบาลราชพิพัฒน์ขอสงวนสิทธิ์การเข้าใช้ให้เฉพาะแก่ท่านที่ให้ข้อมูลและลงทะเบียนสร้างบัญชีผู้ใช้แอปพลิเคชันเท่านั้น โรงพยาบาลราชพิพัฒน์ขอสงวนสิทธิ์ในการยกเลิกหรือปฎิเสธการให้บริการแก่ท่านไม่ว่าด้วยเหตุผลใด ท่านจะไม่ปฏิบัติหรือพยายามที่จะกระทำการใดดังต่อไปนี้</p>
                <p className="indent-8"><span className="font-semibold">ก. </span> ปลอมแปลงหรือบิดเบือนข้อมูลเพื่อสวมรอยเป็นบุคคลอื่นหรือ ทำให้เข้าใจว่าตนเป็นบุคคลอื่น</p>
                <p className="indent-8"><span className="font-semibold">ข. </span> ใช้แอปพลิเคชันเพื่อกระทำผิดกฎหมายหรือกฎระเบียบของสังคม</p>
                <p className="indent-8"><span className="font-semibold">ค. </span> คัดลอก ดัดแปลง แก้ไข ปรับปรุงแอปพลิเคชันหรือส่วนใดส่วนหนึ่งของแอปพลิเคชัน</p>
                <p className="indent-8"><span className="font-semibold">ง. </span> เผยแพร่หรือใช้แอปพลิเคชันในการกระจายไวรัสหรือข้อมูลที่ไม่ปลอดภัย</p>
                <p className="indent-8"><span className="font-semibold">จ. </span> การกระทำใดๆ ที่นอกเหนือไปจากการใช้งานโดยทั่วไปตาม วัตถุประสงค์ที่โรงพยาบาลราชพิพัฒน์ระบุไว้ หรือไม่ปฎิบัติข้อตกลงและเงื่อนไขในการให้บริการนั้นๆ </p>
                <p className="indent-8">นอกจากนี้ท่านจะต้องไม่กระทำพฤติกรรมหรือคำพูดไม่เหมาะสม, รุนแรง, ผิดศีลธรรมอันดีของสังคมหรือกฎหมาย ทางโรงพยาบาลราชพิพัฒน์จะไม่รับผิดชอบการกระทำใดๆ ของท่านที่เกิดขึ้นระหว่างการใช้แอปพลิเคชัน โรงพยาบาลราชพิพัฒน์ไม่แนะนำอย่างยิ่งในการใช้งานแอปพลิเคชันผ่านคอมพิวเตอร์หรืออุปกรณ์สาธารณะ และไม่แนะนำให้เก็บหรือจดจำข้อมูลผู้ใช้โดยเฉพาะรหัสผ่านในเว็บบราวเซอร์หรือโปรแกรมอื่นๆ
                </p>
            </div> */}
    </div>
  );
};
